sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.c
/*!
    \file    gd32a7xx_adc.c
    \brief   ADC driver

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

/*!
    \page    misra_violations MISRA-C:2012 violations

    \section [MISRA-C:2012]
             Violates MISRA C:2012 Rule-16.1 (Required) All switch statements shall be well-formed.
             The for loop statement is necessary in the switch statement, otherwise, it will increase the amount of code.
*/

#include "gd32a7xx_adc.h"

/*!
    \brief      reset ADC (API_ID(0x0001U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[out] none
    \retval     none
*/
void adc_deinit(uint32_t adc_periph)
{
    uint32_t i;
    uint32_t j;
    uint32_t x;
    uint32_t y;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0001U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* reset ADC registers */
        ADC_CTL(adc_periph) = ADC_RESET_VALUE;
        ADC_STAT(adc_periph) = ADC_STAT_RESET_VALUE;
        for(i = 0x02U; i < 0x50U; i ++){
            x = i;
            REG32((adc_periph) + (x*0x04U)) = ADC_RESET_VALUE;
        }
        /* reset routine sequence registers */
        for(i = 0x80U; i < 0xBCU; i ++){
            x = i;
            REG32((adc_periph) + (x*0x04U)) = ADC_RESET_VALUE;
        }
        /* reset inserted sequence registers */
        for(j = 0x00U; j < 0x06U; j ++){
            for(i = 0xC0U; i < 0x108U; i ++){
                x = i;
                y = j;
                REG32((adc_periph) + (x*0x04U)+(y*0x50U)) = ADC_RESET_VALUE;
            }
        }
        /* reset selftest sequence registers */
        for(i = 0x180U; i < 0x187U; i ++){
            x = i;
            REG32((adc_periph) + (x*0x00000004U)) = ADC_RESET_VALUE;
        }
        ADC_SSTWDCFGx(adc_periph, 0U) = ADC_SSTWDCFG0_RESET_VALUE;
        ADC_SSTWDCFGx(adc_periph, 1U) = ADC_SSTWDCFG1_RESET_VALUE;
        ADC_SSTWDCFGx(adc_periph, 2U) = ADC_SSTWDCFG2_RESET_VALUE;
        ADC_CSTWDCFGx(adc_periph, 0U) = ADC_CSTWDCFGx_RESET_VALUE;
        ADC_CSTWDCFGx(adc_periph, 1U) = ADC_CSTWDCFGx_RESET_VALUE;
        ADC_CSTWDCFGx(adc_periph, 2U) = ADC_CSTWDCFGx_RESET_VALUE;
        ADC_CSTWDCFGx(adc_periph, 3U) = ADC_CSTWDCFG3_RESET_VALUE;
        ADC_DTALTCFG(adc_periph) = ADC_RESET_VALUE;

        switch(adc_periph) {
        case ADC0:
            rcu_periph_reset_enable(RCU_ADC0RST);
            rcu_periph_reset_disable(RCU_ADC0RST);
            break;
        case ADC1:
            rcu_periph_reset_enable(RCU_ADC1RST);
            rcu_periph_reset_disable(RCU_ADC1RST);
            break;
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
        case ADC2:
            rcu_periph_reset_enable(RCU_ADC2RST);
            rcu_periph_reset_disable(RCU_ADC2RST);
            break;
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
        default:
            break;
        }
    }
}

/*!
    \brief      enable ADC interface (API_ID(0x0002U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[out] none
    \retval     none
*/
void adc_enable(uint32_t adc_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0002U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U == (ADC_CTL(adc_periph) & ADC_CTL_ADCON)) {
            /* enable ADC */
            ADC_CTL(adc_periph) |= (uint32_t)ADC_CTL_ADCON;
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      disable ADC interface (API_ID(0x0003U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[out] none
    \retval     none
*/
void adc_disable(uint32_t adc_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0003U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* disable ADC */
        ADC_CTL(adc_periph) &= ~((uint32_t)ADC_CTL_ADCON);
    }
}

/*!
    \brief      configure ADC data alignment (API_ID(0x0004U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  data_alignment: data alignment select
                only one parameter can be selected which is shown as below:
      \arg        ADC_DATAALIGN_RIGHT: right alignment
      \arg        ADC_DATAALIGN_LEFT: left alignment
    \param[out] none
    \retval     none
*/
void adc_data_alignment_config(uint32_t adc_periph, uint32_t data_alignment)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0004U), ERR_PERIPH);
    } else if(NOT_ADC_DATA_ALIGNMENT(data_alignment)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0004U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_CTL(adc_periph) &= ~((uint32_t)ADC_CTL_DAL);
        ADC_CTL(adc_periph) |= (uint32_t)data_alignment;
    }
}

/*!
    \brief      configure ADC resolution (API_ID(0x0005U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  resolution: ADC resolution
                only one parameter can be selected which is shown as below:
      \arg        ADC_RESOLUTION_12B: 12-bit ADC resolution
      \arg        ADC_RESOLUTION_10B: 10-bit ADC resolution
      \arg        ADC_RESOLUTION_8B: 8-bit ADC resolution
      \arg        ADC_RESOLUTION_6B: 6-bit ADC resolution
    \param[out] none
    \retval     none
*/
void adc_resolution_config(uint32_t adc_periph, uint32_t resolution)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0005U), ERR_PERIPH);
    } else if(NOT_ADC_RESOLUTION(resolution)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_CTL(adc_periph) &= ~((uint32_t)ADC_CTL_DRES);
        ADC_CTL(adc_periph) |= (uint32_t)resolution;
    }
}

/*!
    \brief      configure the ADC sync mode (API_ID(0x0006U))
    \param[in]  mode: ADC mode
                only one parameter can be selected which is shown as below:
      \arg        ADC_MODE_FREE: all the ADCs work independently
      \arg        ADC_DUAL_ROUTINE_PARALLEL_INSERTED_PARALLEL: ADC0 and ADC1 work in combined routine parallel + inserted parallel mode
      \arg        ADC_DUAL_ROUTINE_PARALLEL_ROTATION: ADC0 and ADC1 work in combined routine parallel + trigger rotation mode
      \arg        ADC_DUAL_INSERTED_PARALLEL: ADC0 and ADC1 work in inserted parallel mode
      \arg        ADC_DUAL_ROUTINE_PARALLEL: ADC0 and ADC1 work in routine parallel mode
      \arg        ADC_DUAL_FOLLOWUP: ADC0 and ADC1 work in follow-up mode
      \arg        ADC_DUAL_TRRIGGER_ROTATION: ADC0 and ADC1 work in trigger rotation mode
      \arg        ADC_ALL_ROUTINE_PARALLEL_INSERTED_PARALLEL: ADC0, ADC1 and ADC2 work in combined routine parallel + inserted parallel mode (only available in GD32A714X, GD32A72XX and GD32A74XX)
      \arg        ADC_ALL_ROUTINE_PARALLEL_ROTATION: ADC0, ADC1 and ADC2 work in combined routine parallel + trigger rotation mode (only available in GD32A714X, GD32A72XX and GD32A74XX)
      \arg        ADC_ALL_INSERTED_PARALLEL: ADC0, ADC1 and ADC2 work in inserted parallel mode (only available in GD32A714X, GD32A72XX and GD32A74XX)
      \arg        ADC_ALL_ROUTINE_PARALLEL: ADC0, ADC1 and ADC2 work in routine parallel mode (only available in GD32A714X, GD32A72XX and GD32A74XX)
      \arg        ADC_ALL_FOLLOWUP: ADC0, ADC1 and ADC2 work in follow-up mode (only available in GD32A714X, GD32A72XX and GD32A74XX)
      \arg        ADC_ALL_TRRIGGER_ROTATION: ADC0, ADC1 and ADC2 work in trigger rotation mode (only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[out] none
    \retval     none
*/
void adc_mode_config(uint32_t mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_mode(mode)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0006U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_SYNCCTL &= ~((uint32_t)ADC_SYNCCTL_SYNCM);
        ADC_SYNCCTL |= mode;
    }
}

/*!
    \brief      configure ADC internal channels (API_ID(0x0007U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  internal_channel: the internal channels
                only one parameter can be selected which is shown as below:
      \arg        ADC_CHANNEL_INTERNAL_VREFINT: internal reference voltage vrefint channel
      \arg        ADC_CHANNEL_INTERNAL_HP_TEMPSENSOR: high-precision temperature sensor channel
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void adc_internal_channel_config(uint32_t adc_periph, uint32_t internal_channel, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0007U), ERR_PERIPH);
    } else if(NOT_ADC_INTERNAL_CHANNEL(internal_channel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0007U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_ENABLE_DISABLE(newvalue)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0007U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            ADC_CTL(adc_periph) |= (uint32_t)internal_channel;
        } else {
            ADC_CTL(adc_periph) &= ~((uint32_t)internal_channel);
        }
    }
}

/*!
    \brief      configure ADC calibration mode (API_ID(0x0008U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  clb_mode: calibration mode
                only one parameter can be selected which is shown as below:
      \arg        ADC_CALIBRATION_OFFSET_MISMATCH: ADC calibration offset and mismatch mode
      \arg        ADC_CALIBRATION_OFFSET: ADC calibration offset mode
    \param[out] none
    \retval     none
*/
void adc_calibration_mode_config(uint32_t adc_periph, uint32_t clb_mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0008U), ERR_PERIPH);
    } else if(NOT_ADC_CALIBRATION_MODE(clb_mode)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0008U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_CTL(adc_periph) &= ~((uint32_t)ADC_CTL_CALMOD);
        ADC_CTL(adc_periph) |= clb_mode;
    }
}

/*!
    \brief      configure ADC calibration number (API_ID(0x0009U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  cal_num: calibration number
                only one parameter can be selected which is shown as below:
      \arg        ADC_CALIBRATION_NUM1: calibrate 1 time
      \arg        ADC_CALIBRATION_NUM3: calibrate 3 times
      \arg        ADC_CALIBRATION_NUM7: calibrate 7 times
      \arg        ADC_CALIBRATION_NUM15: calibrate 15 times
      \arg        ADC_CALIBRATION_NUM31: calibrate 31 times
    \param[out] none
    \retval     none
*/
void adc_calibration_number(uint32_t adc_periph, uint32_t cal_num)
{
    uint32_t reg;

