sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0009U), ERR_PERIPH);
    } else if(NOT_ADC_CALIBRATION_NUMBER(cal_num)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = ADC_CTL(adc_periph);
        reg &= ~((uint32_t)ADC_CTL_CALNUM);
        reg |= cal_num;
        ADC_CTL(adc_periph) = reg;
    }
}

/*!
    \brief      ADC calibration and reset calibration (API_ID(0x000AU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[out] none
    \retval     ErrStatus: status of error (ERROR or SUCCESS)
*/
ErrStatus adc_calibration_enable(uint32_t adc_periph)
{
    uint32_t timerout = ADC_CALIBRATION_TIMEROUT;
    ErrStatus status = ERROR;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x000AU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* reset the selected ADC calibration registers */
        ADC_CTL(adc_periph) |= (uint32_t) ADC_CTL_RSTCLB;
        /* check the RSTCLB bit state */
        while((0U != (ADC_CTL(adc_periph) & ADC_CTL_RSTCLB)) && (0U != timerout)) {
            timerout --;
        }

        if(0U != (ADC_CTL(adc_periph) & ADC_CTL_RSTCLB)) {
            /* illegal parameters */
        } else {
            /* enable ADC calibration process */
            ADC_CTL(adc_periph) |= ADC_CTL_CLB;
            /* check the CLB bit state */
            while((0U != (ADC_CTL(adc_periph) & ADC_CTL_CLB)) && (0U != timerout)) {
                timerout --;
            }
            
            if(0U != (ADC_CTL(adc_periph) & ADC_CTL_CLB)) {
                /* illegal parameters */
            } else {
                status = SUCCESS;
            }
        }
    }
    return status;
}

/*!
    \brief      enable DMA request (API_ID(0x000BU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[out] none
    \retval     none
*/
void adc_dma_mode_enable(uint32_t adc_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x000BU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_CTL(adc_periph) |= (uint32_t)ADC_CTL_DMA;
    }
}

/*!
    \brief      disable DMA request (API_ID(0x000CU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[out] none
    \retval     none
*/
void adc_dma_mode_disable(uint32_t adc_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x000CU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_CTL(adc_periph) &= ~((uint32_t)ADC_CTL_DMA);
    }
}

/*!
    \brief      enable ADC sequence DMA request (API_ID(0x000DU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[out] none
    \retval     none
*/
void adc_sequence_dma_enable(uint32_t adc_periph, uint32_t adc_sequence)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x000DU), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x000DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            ADC_RDATA(adc_periph) |= ((uint32_t)ADC_RDATA_RDMAEN);
        } else {
            ADC_IxDATA(adc_periph, adc_sequence) |= ((uint32_t)ADC_IDATA_IDMAEN);
        }
    }
}

/*!
    \brief      disable ADC sequence DMA request (API_ID(0x000EU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[out] none
    \retval     none
*/
void adc_sequence_dma_disable(uint32_t adc_periph, uint32_t adc_sequence)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x000EU), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x000EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            ADC_RDATA(adc_periph) &= ~((uint32_t)ADC_RDATA_RDMAEN);
        } else {
            ADC_IxDATA(adc_periph, adc_sequence) &= ~((uint32_t)ADC_IDATA_IDMAEN);
        }
    }
}

/*!
    \brief      enable ADC sequence channel dma request (API_ID(0x000FU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  rank: the sequence rank, routine sequence is 0 to 27(ADC2 just supports 0 to 23), and inserted sequence is 0 to 3
    \param[out] none
    \retval     none
*/
void adc_sequence_channel_dma_enable(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x000FU), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x000FU), ERR_PARAM_INVALID);
    } else if(NOT_ADC_SEQUENCE_RANK(rank)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x000FU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            ADC_RCFGx(adc_periph, rank) |= ((uint32_t)ADC_RCFG_RCHDMAEN);
        } else {
            ADC_IxCFGy(adc_periph, adc_sequence, rank) |= ((uint32_t)ADC_ICFG_ICHDMAEN);
        }
    }
}

/*!
    \brief      disable ADC sequence channel dma request (API_ID(0x0010U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  rank: the sequence rank, routine sequence is 0 to 27(ADC2 just supports 0 to 23), and inserted sequence is 0 to 3
    \param[out] none
    \retval     none
*/
void adc_sequence_channel_dma_disable(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0010U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0010U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_SEQUENCE_RANK(rank)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0010U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            ADC_RCFGx(adc_periph, rank) &= ~((uint32_t)ADC_RCFG_RCHDMAEN);
        } else {
            ADC_IxCFGy(adc_periph, adc_sequence, rank) &= ~((uint32_t)ADC_ICFG_ICHDMAEN);
        }
    }
}

/*!
    \brief      when DMA=1, the DMA engine issues a request at end of each conversion (API_ID(0x0011U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[out] none
    \retval     none
*/
void adc_dma_request_after_last_enable(uint32_t adc_periph, uint32_t adc_sequence)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0011U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0011U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            ADC_RCTL(adc_periph) |= ((uint32_t)ADC_RCTL_RDDM);
        } else {
            ADC_IxCTL(adc_periph, adc_sequence) |= ((uint32_t)ADC_ICTL_IDDM);
        }
    }
}

/*!
    \brief      the DMA engine is disabled after the end of transfer signal from DMA controller is detected (API_ID(0x0012U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[out] none
    \retval     none
*/
void adc_dma_request_after_last_disable(uint32_t adc_periph, uint32_t adc_sequence)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0012U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0012U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            ADC_RCTL(adc_periph) &= ~((uint32_t)ADC_RCTL_RDDM);
        } else {
            ADC_IxCTL(adc_periph, adc_sequence) &= ~((uint32_t)ADC_ICTL_IDDM);
        }
    }
}

/*!
    \brief      configure ADC average conversion (API_ID(0x0013U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void adc_average_config(uint32_t adc_periph, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0013U), ERR_PERIPH);
    } else if(NOT_ADC_ENABLE_DISABLE(newvalue)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0013U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            ADC_CTL(adc_periph) |= ADC_CTL_AVRGEN;
        } else {
            ADC_CTL(adc_periph) &= ~ADC_CTL_AVRGEN;
        }
    }
}

/*!
    \brief      configure ADC average conversion number (API_ID(0x0014U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  aver_num: average number
                only one parameter can be selected which is shown as below:
      \arg        ADC_AVERAGE_2_CONVERSIONS: 2 conversion data average
      \arg        ADC_AVERAGE_4_CONVERSIONS: 4 conversion data average
      \arg        ADC_AVERAGE_8_CONVERSIONS: 8 conversion data average
      \arg        ADC_AVERAGE_16_CONVERSIONS: 16 conversion data average
      \arg        ADC_AVERAGE_32_CONVERSIONS: 32 conversion data average
      \arg        ADC_AVERAGE_64_CONVERSIONS: 64 conversion data average
      \arg        ADC_AVERAGE_128_CONVERSIONS: 128 conversion data average
      \arg        ADC_AVERAGE_256_CONVERSIONS: 256 conversion data average
    \param[out] none
    \retval     none
*/
void adc_average_number_config(uint32_t adc_periph, uint32_t aver_num)
{
    uint32_t reg;

