sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0014U), ERR_PERIPH);
    } else if(NOT_ADC_AVERAGE_NUMBER(aver_num)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0014U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = ADC_CTL(adc_periph);

        reg &= ~((uint32_t)ADC_CTL_AVRGSEL);
        reg |= aver_num;
        ADC_CTL(adc_periph) = reg;
    }
}

/*!
    \brief      configure ADC overwrite mode (API_ID(0x0015U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void adc_overwrite_config(uint32_t adc_periph, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0015U), ERR_PERIPH);
    } else if(NOT_ADC_ENABLE_DISABLE(newvalue)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0015U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            ADC_CTL(adc_periph) |= ADC_CTL_OVWEN;
        } else {
            ADC_CTL(adc_periph) &= ~ADC_CTL_OVWEN;
        }
    }
}

/*!
    \brief      configure the ADC idle state clock (API_ID(0x0016U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  ack_cfg: auto clock configure
                only one parameter can be selected which is shown as below:
      \arg        ADC_CLOCK_IDLE_STATE_ON: clock on
      \arg        ADC_CLOCK_IDLE_STATE_OFF: clock automatic off when the ADC in idle state
    \param[out] none
    \retval     none
*/
void adc_auto_clock_config(uint32_t adc_periph, uint32_t ack_cfg)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0016U), ERR_PERIPH);
    } else if(NOT_ADC_AUTO_CLOCK(ack_cfg)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0016U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_CTL(adc_periph) &= ~((uint32_t)ADC_CTL_CKAUTO);
        ADC_CTL(adc_periph) |= ack_cfg;
    }
}

/*!
    \brief      configure the ADC external analog multiplexers decode signals delay (API_ID(0x0017U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  external_delay: external decode signals delay, it can be 0~0xFFFF
    \param[out] none
    \retval     none
*/
void adc_external_decode_signals_delay_config(uint32_t adc_periph, uint32_t external_delay)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0017U), ERR_PERIPH);
    } else if(NOT_ADC_DECODE_SIGNAL_DELAY(external_delay)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0017U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_EDDLY(adc_periph) &= ~((uint32_t)ADC_EDDLY_EDDLY);
        ADC_EDDLY(adc_periph) |= external_delay;
    }
}

/*!
    \brief      configure the ADC convert start delay (API_ID(0x0018U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  cs_delay: the delay from trigger to start conversion, it can be 0~0xFFFF
    \param[out] none
    \retval     none
*/
void adc_convert_start_delay_config(uint32_t adc_periph, uint32_t cs_delay)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0018U), ERR_PERIPH);
    } else if(NOT_ADC_START_CONVERSION_DELAY(cs_delay)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0018U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_CSDLY(adc_periph) &= ~((uint32_t)ADC_CSDLY_CSDLY);
        ADC_CSDLY(adc_periph) |= cs_delay;
    }
}

/*!
    \brief      enable the ADC convert start delay sequence (API_ID(0x0019U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  cs_sequence: the delay from trigger to start conversion of sequence enable
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE_TRIGGER_DELAY: routine sequence trigger delay
      \arg        ADC_INSERTED_SEQUENCE0_TRIGGER_DELAY: inserted sequence 0 trigger delay
      \arg        ADC_INSERTED_SEQUENCE1_TRIGGER_DELAY: inserted sequence 1 trigger delay
      \arg        ADC_INSERTED_SEQUENCE2_TRIGGER_DELAY: inserted sequence 2 trigger delay
      \arg        ADC_INSERTED_SEQUENCE3_TRIGGER_DELAY: inserted sequence 3 trigger delay
      \arg        ADC_INSERTED_SEQUENCE4_TRIGGER_DELAY: inserted sequence 4 trigger delay
      \arg        ADC_INSERTED_SEQUENCE5_TRIGGER_DELAY: inserted sequence 5 trigger delay
    \param[out] none
    \retval     none
*/
void adc_convert_start_delay_enable(uint32_t adc_periph, uint32_t cs_sequence)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0019U), ERR_PERIPH);
    } else if(NOT_ADC_DELAY_ENABLE_SEQUENCE(cs_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0019U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_CSDLY(adc_periph) |= cs_sequence;
    }
}

/*!
    \brief      disable the ADC convert start delay sequence (API_ID(0x001AU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  cs_sequence: the delay from trigger to start conversion enable
                only one parameter can be selected which is shown as below:
      \arg        ADC_ALL_TRIGGER_DELAY_DISABLE: all groups trigger delay disable
      \arg        ADC_ROUTINE_SEQUENCE_TRIGGER_DELAY: routine sequence trigger delay
      \arg        ADC_INSERTED_SEQUENCE0_TRIGGER_DELAY: inserted sequence 0 trigger delay
      \arg        ADC_INSERTED_SEQUENCE1_TRIGGER_DELAY: inserted sequence 1 trigger delay
      \arg        ADC_INSERTED_SEQUENCE2_TRIGGER_DELAY: inserted sequence 2 trigger delay
      \arg        ADC_INSERTED_SEQUENCE3_TRIGGER_DELAY: inserted sequence 3 trigger delay
      \arg        ADC_INSERTED_SEQUENCE4_TRIGGER_DELAY: inserted sequence 4 trigger delay
      \arg        ADC_INSERTED_SEQUENCE5_TRIGGER_DELAY: inserted sequence 5 trigger delay
    \param[out] none
    \retval     none
*/
void adc_convert_start_delay_disable(uint32_t adc_periph, uint32_t cs_sequence)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001AU), ERR_PERIPH);
    } else if(NOT_ADC_DELAY_DISABLE_SEQUENCE(cs_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ALL_TRIGGER_DELAY_DISABLE == cs_sequence) {
            ADC_CSDLY(adc_periph) = (uint32_t)cs_sequence;
        } else {
            ADC_CSDLY(adc_periph) &= ~((uint32_t)cs_sequence);
        }
    }
}

/*!
    \brief      configure ADC restart or resume sequence when this sequence be suspended (API_ID(0x001BU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  adc_resel: select which way to recovery sequence conversion
                only one parameter can be selected which is shown as below:
      \arg        ADC_RESUME_SEQUENCE: resume sequence conversion
      \arg        ADC_RESTART_SEQUENCE: restart sequence conversion
    \param[out] none
    \retval     none
*/
void adc_restart_resume_sequence_config(uint32_t adc_periph, uint32_t adc_sequence, uint32_t adc_resel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001BU), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001BU), ERR_PARAM_INVALID);
    } else if(NOT_ADC_RECOVERY_CONVERSION(adc_resel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            ADC_RCTL(adc_periph) &= ~((uint32_t)ADC_RCTL_RRESTART);
            ADC_RCTL(adc_periph) |= (uint32_t)adc_resel;
        } else {
            ADC_IxCTL(adc_periph, adc_sequence) &= ~((uint32_t)ADC_ICTL_IRESTART);
            ADC_IxCTL(adc_periph, adc_sequence) |= (uint32_t)adc_resel;
        }
    }
}

/*!
    \brief      abort ADC current sequence conversion (API_ID(0x001CU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[out] none
    \retval     none
*/
void adc_sequence_abort(uint32_t adc_periph, uint32_t adc_sequence)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001CU), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            ADC_RCTL(adc_periph) |= (uint32_t)ADC_RCTL_RABORT;
        } else {
            ADC_IxCTL(adc_periph, adc_sequence) |= (uint32_t)ADC_ICTL_IABORT;
        }
    }
}

/*!
    \brief      configure ADC gain mode (API_ID(0x001DU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void adc_gain_config(uint32_t adc_periph, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001DU), ERR_PERIPH);
    } else if(NOT_ADC_ENABLE_DISABLE(newvalue)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            ADC_CTL(adc_periph) |= ADC_CTL_GAINEN;
        } else {
            ADC_CTL(adc_periph) &= ~ADC_CTL_GAINEN;
        }
    }
}

/*!
    \brief      configure the ADC gain factor (API_ID(0x001EU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  gain_factor: gain factor, it can be 0~0x3FFF
    \param[out] none
    \retval     none
*/
void adc_gain_factor_config(uint32_t adc_periph, uint32_t gain_factor)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001EU), ERR_PERIPH);
    } else if(NOT_ADC_GAIN_FACTOR(gain_factor)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001EU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_GAINCFG(adc_periph) &= ~((uint32_t)ADC_GAINCFG_GAIN);
        ADC_GAINCFG(adc_periph) |= gain_factor;
    }
}

/*!
    \brief      enable offset y mode (API_ID(0x001FU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  off_num: offset number, it can be 0~3
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void adc_offset_config(uint32_t adc_periph, uint32_t off_num, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001FU), ERR_PERIPH);
    } else if(NOT_ADC_OFFSET_NUMBER(off_num)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001FU), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ADC_ENABLE_DISABLE(newvalue)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            ADC_OFFCFGx(adc_periph, off_num) |= ADC_OFFCFG_OFFEN;
        } else {
            ADC_OFFCFGx(adc_periph, off_num) &= ~ADC_OFFCFG_OFFEN;
        }
    }
}

/*!
    \brief      configure the ADC offset function parameters (API_ID(0x0020U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  off_num: offset number, it can be 0~3
    \param[in]  off_factor: offset factor, it can be 0~0xFFF
    \param[in]  off_ch: offset channel, it can be 0~0x3D
    \param[in]  off_pos: offset positive or negative
                only one parameter can be selected which is shown as below:
      \arg        ADC_NEGATIVE_OFFSET: negative offset
      \arg        ADC_POSITIVE_OFFSET: positive offset
    \param[out] none
    \retval     none
*/
void adc_offset_parameter_config(uint32_t adc_periph, uint32_t off_num, uint32_t off_factor, uint32_t off_ch, uint32_t off_pos)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0020U), ERR_PERIPH);
    } else if(NOT_ADC_OFFSET_NUMBER(off_num)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0020U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ADC_OFFSET_FACTOR(off_factor)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0020U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ADC_OFFSET_CHANNEL(off_ch)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0020U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ADC_OFFSET_POSITIVE(off_pos)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0020U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure the offset factor */
        ADC_OFFCFGx(adc_periph, off_num) &= ~((uint32_t)ADC_OFFCFG_OFFSET);
        ADC_OFFCFGx(adc_periph, off_num) |= off_factor;

        /* configure the channel selection for offset */
        ADC_OFFCFGx(adc_periph, off_num) &= ~((uint32_t)ADC_OFFCFG_OFFCH);
        ADC_OFFCFGx(adc_periph, off_num) |= off_ch << 16U;

        /* configure the positive offset */
        ADC_OFFCFGx(adc_periph, off_num) &= ~((uint32_t)ADC_OFFCFG_OFFPOS);
        ADC_OFFCFGx(adc_periph, off_num) |= off_pos;
    }
}

/*!
    \brief      configure ADC data signed mode (API_ID(0x0021U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  off_num: offset number, it can be 0~3
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void adc_signed_data_configure(uint32_t adc_periph, uint32_t off_num, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0021U), ERR_PERIPH);
    } else if(NOT_ADC_OFFSET_NUMBER(off_num)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0021U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ADC_ENABLE_DISABLE(newvalue)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0021U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            ADC_OFFCFGx(adc_periph, off_num) |= ADC_OFFCFG_SIGNEN;
        } else {
            ADC_OFFCFGx(adc_periph, off_num) &= ~ADC_OFFCFG_SIGNEN;
        }
    }
}

/*!
    \brief      configure the length of routine sequence or inserted sequence (API_ID(0x0022U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  length: the length of the channel, routine channel 1-28, inserted channel 1-4
    \param[out] none
    \retval     none
*/
void adc_channel_length_config(uint32_t adc_periph, uint32_t adc_sequence, uint32_t length)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0022U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0022U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            if((length >= 1U) && (length <= 28U)) {
                /* configure the length of routine sequence */
                ADC_RCTL(adc_periph) &= ~((uint32_t)ADC_RCTL_RL);
                ADC_RCTL(adc_periph) |= RCTL_RL((uint32_t)(length - 1U));
            } else {
                /* illegal parameters */
            }
        } else {
            if((length >= 1U) && (length <= 4U)) {
                /* configure the length of inserted sequence */
                ADC_IxCTL(adc_periph, adc_sequence) &= ~((uint32_t)ADC_ICTL_IL);
                ADC_IxCTL(adc_periph, adc_sequence) |= ICTL_IL((uint32_t)(length - 1U));
            } else {
                /* illegal parameters */
            }
        }
    }
}

/*!
    \brief      configure ADC sequence channel (API_ID(0x0023U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  rank: the sequence rank, routine sequence is 0 to 27(ADC2 just supports 0 to 23), and inserted sequence is 0 to 3
    \param[in]  adc_channel: the ADC channel, this parameter must be between 0 to 61
    \param[in]  sample_time: the sample time value, this parameter must be between 0 to 638
    \param[out] none
    \retval     none
*/
void adc_sequence_channel_config(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank, uint32_t adc_channel, uint32_t sample_time)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0023U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0023U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_SEQUENCE_RANK(rank)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0023U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ADC_CHANNEL(adc_channel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0023U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ADC_SAMPLE_TIME(sample_time)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0023U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            ADC_RCFGx(adc_periph, rank) &= ~((uint32_t)(ADC_RCFG_RSQ | ADC_RCFG_RSMP));
            ADC_RCFGx(adc_periph, rank) |= (uint32_t)(adc_channel | (sample_time << 16U));
        } else {
            ADC_IxCFGy(adc_periph, adc_sequence, rank) &= ~((uint32_t)(ADC_ICFG_ISQ | ADC_ICFG_ISMP));
            ADC_IxCFGy(adc_periph, adc_sequence, rank) |= (uint32_t)(adc_channel | (sample_time << 16U));
        }
    }
}

/*!
    \brief      configure the routine sequence conversion mode (API_ID(0x0024U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_mode: select the conversion mode
                only one parameter can be selected which is shown as below:
      \arg        ADC_ONE_SHOT_MODE: one-shot mode
      \arg        ADC_CONTINUOUS_MODE: continuous mode
    \param[out] none
    \retval     none
*/
void adc_routine_sequence_conversion_mode_config(uint32_t adc_periph, uint32_t adc_mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0024U), ERR_PERIPH);
    } else if(NOT_ADC_ROUTINE_MODE(adc_mode)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0024U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_RCTL(adc_periph) &= ~((uint32_t)ADC_RCTL_RMODE);
        ADC_RCTL(adc_periph) |= (uint32_t)adc_mode;
    }
}

