sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.c
/*!
    \brief      configure ADC external trigger mode for channel (API_ID(0x0025U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  adc_trigger: select external trigger
                only one parameter can be selected which is shown as below:
      \arg        ADC_EXTERNAL_TRIGGER_DISABLE: external trigger for channel disable
      \arg        ADC_EXTERNAL_TRIGGER_RISING_EDGE: rising edge of external trigger for channel
      \arg        ADC_EXTERNAL_TRIGGER_FALLING_EDGE: falling edge of external trigger for channel
      \arg        ADC_EXTERNAL_TRIGGER_RISING_FALLING_EDGE: rising and falling edge of external trigger for channel
    \param[out] none
    \retval     none
*/
void adc_external_trigger_config(uint32_t adc_periph, uint32_t adc_sequence, uint32_t adc_trigger)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0025U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0025U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_TRIGGER(adc_trigger)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0025U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            ADC_RCTL(adc_periph) &= ~((uint32_t)ADC_RCTL_ETMRC);
            ADC_RCTL(adc_periph) |= (uint32_t)adc_trigger;
        } else {
            ADC_IxCTL(adc_periph, adc_sequence) &= ~((uint32_t)ADC_ICTL_ETMIC);
            ADC_IxCTL(adc_periph, adc_sequence) |= (uint32_t)adc_trigger;
        }
    }
}

/*!
    \brief      enable ADC sequence software trigger (API_ID(0x0026U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[out] none
    \retval     none
*/
void adc_sequence_software_trigger_enable(uint32_t adc_periph, uint32_t adc_sequence)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0026U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0026U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            ADC_RCTL(adc_periph) |= (uint32_t)ADC_RCTL_SWRCST;
        } else {
            ADC_IxCTL(adc_periph, adc_sequence) |= (uint32_t)ADC_ICTL_SWICST;
        }
    }
}

/*!
    \brief      configure ADC channel pre-sample function (API_ID(0x0027U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_channel: it can be 0~61
    \param[in]  presamplepara: ADC pre-sample function parameter struct
                  time:  it can be 0~638
                  volselect: ADC_PSMPVSEL_VREFN,ADC_PSMPVSEL_VREFP
                  follow:ADC_NO_CONVERSION_AFTER_PRESAMPLE,ADC_PRESAMPLE_FOLLOW_CONVERSION
                  enable: ENABLE,DISABLE
    \param[out] none
    \retval     none
*/
void adc_channel_presample_config(uint32_t adc_periph, uint32_t adc_channel, adc_presample_parameter_struct *presamplepara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0027U), ERR_PERIPH);
    } else if(NOT_ADC_CHANNEL(adc_channel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0027U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_VALID_POINTER(presamplepara)) {
	fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0027U), ERR_PARAM_POINTER);
    } else
	
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_CHCFGx(adc_periph, adc_channel) &= ~((uint32_t)(ADC_CHCFG_PSMPVSEL | ADC_CHCFG_DISSMP));
        ADC_PSMPCFG(adc_periph) &= ~((uint32_t)ADC_PSMPCFG_PSMP);

        if(ENABLE == presamplepara->enable) {
            ADC_CHCFGx(adc_periph, adc_channel) |= (uint32_t)(presamplepara->volselect | presamplepara->follow);
            ADC_PSMPCFG(adc_periph) |= (uint32_t)presamplepara->time;
            ADC_CHCFGx(adc_periph, adc_channel) |= ADC_CHCFG_PSMPEN;
        } else {
            ADC_CHCFGx(adc_periph, adc_channel) &= ~(uint32_t)ADC_CHCFG_PSMPEN;
        }
    }
}


/*!
    \brief      read ADC sequence channel data register (API_ID(0x0028U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  rank: the sequence rank, routine sequence is 0 to 27(ADC2 just supports 0 to 23), and inserted sequence is 0 to 3
    \param[out] none
    \retval     the conversion value: 0~0xFFFF
*/
uint16_t adc_channel_data_read(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank)
{
    uint16_t data = 0U;

