sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0028U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0028U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_SEQUENCE_RANK(rank)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0028U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            data = (uint16_t)(ADC_RCHDATAx(adc_periph, rank) & ADC_RCHDATA_RCHDATA);
        } else {
            data = (uint16_t)(ADC_IxCHDATAy(adc_periph, adc_sequence, rank) & ADC_ICHDATA_ICHDATA);
        }
    }
    return data;
}

/*!
    \brief      read ADC sequence data register (API_ID(0x0029U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[out] none
    \retval     the conversion value: 0~0xFFFF
*/
uint16_t adc_sequence_data_read(uint32_t adc_periph, uint32_t adc_sequence)
{
    uint16_t data = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0029U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0029U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            data = (uint16_t)(ADC_RDATA(adc_periph) & ADC_RDATA_RDATA);
        } else {
            data = (uint16_t)(ADC_IxDATA(adc_periph, adc_sequence) & ADC_IDATA_IDATA);
        }
    }
    return data;
}

/*!
    \brief      configure ADC channel analog watchdog events (API_ID(0x002AU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_channel: it can be 0~61
    \param[in]  awd_sel: analog watchdog select
                only one parameter can be selected which is shown as below:
      \arg        ADC_ANALOG_WATCHDOG0: analog watchdog 0
      \arg        ADC_ANALOG_WATCHDOG1: analog watchdog 1
      \arg        ADC_ANALOG_WATCHDOG2: analog watchdog 2
      \arg        ADC_ANALOG_WATCHDOG3: analog watchdog 3
    \param[in]  awd_event: analog watchdog event select
                only one parameter can be selected which is shown as below:
      \arg        ADC_ANALOG_WATCHDOG_DISABLE: disable analog watchdog
      \arg        ADC_RESULT_WDLT: result <= WDLT
      \arg        ADC_WDLT_RESULT_WDHT: WDLT < result <= WDHT
      \arg        ADC_WDHT_RESULT: result > WDHT
      \arg        ADC_WDLT_RESULT: result > WDLT
      \arg        ADC_WDHT_RESULT_WDLT: result > WDHT or result <= WDLT
      \arg        ADC_RESULT_WDHT: result <= WDHT
    \param[out] none
    \retval     none
*/
void adc_channel_analog_watchdog_event_config(uint32_t adc_periph, uint32_t adc_channel, uint32_t awd_sel, uint32_t awd_event)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002AU), ERR_PERIPH);
    } else if(NOT_ADC_CHANNEL(adc_channel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002AU), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ADC_ANALOG_WATCHDOG(awd_sel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002AU), ERR_PARAM_INVALID);
    } else if(NOT_ADC_ANALOG_WATCHDOG_EVENT(awd_event)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_CHCFGx(adc_periph, adc_channel) &= ~((uint32_t)(ADC_CHCFG_WDSEL | ADC_CHCFG_WDMSEL));
        ADC_CHCFGx(adc_periph, adc_channel) |= (uint32_t)((awd_sel << 3) | awd_event);
    }
}

/*!
    \brief      configure the ADC analog watchdog threshold value (API_ID(0x002BU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  awd_sel: analog watchdog select
                only one parameter can be selected which is shown as below:
      \arg        ADC_ANALOG_WATCHDOG0: ADC analog watchdog 0
      \arg        ADC_ANALOG_WATCHDOG1: ADC analog watchdog 1
      \arg        ADC_ANALOG_WATCHDOG2: ADC analog watchdog 2
      \arg        ADC_ANALOG_WATCHDOG3: ADC analog watchdog 3
    \param[in]  low_value: analog watchdog low threshold value, it can be 0~0xFFF
    \param[in]  high_value: analog watchdog high threshold value, it can be 0~0xFFF
    \param[out] none
    \retval     none
*/
void adc_watchdog_threshold_config(uint32_t adc_periph, uint32_t awd_sel, uint32_t low_value, uint32_t high_value)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002BU), ERR_PERIPH);
    } else if(NOT_ADC_ANALOG_WATCHDOG(awd_sel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002BU), ERR_PARAM_INVALID);
    } else if(NOT_ADC_WATCHDOG_THRESHOLD(low_value)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002BU), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ADC_WATCHDOG_THRESHOLD(high_value)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002BU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_WDTx(adc_periph, awd_sel) &= (uint32_t)(~(ADC_WDT_WDHT | ADC_WDT_WDLT));
        ADC_WDTx(adc_periph, awd_sel) |= low_value | (high_value << 16U);
    }
}

/*!
    \brief      configure ADC sequence stream mode (API_ID(0x002CU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void adc_stream_mode_config(uint32_t adc_periph, uint32_t adc_sequence, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002CU), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002CU), ERR_PARAM_INVALID);
    } else if(NOT_ADC_ENABLE_DISABLE(newvalue)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
                ADC_RSTREAM(adc_periph) |= ((uint32_t)ADC_RSTREAM_RSTREAMEN);
            } else {
                ADC_IxSTREAM(adc_periph, adc_sequence) |= ((uint32_t)ADC_ISTREAM_ISTREAMEN);
            }
        } else {
            if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
                ADC_RSTREAM(adc_periph) &= ~((uint32_t)ADC_RSTREAM_RSTREAMEN);
            } else {
                ADC_IxSTREAM(adc_periph, adc_sequence) &= ~((uint32_t)ADC_ISTREAM_ISTREAMEN);
            }
        }
    }
}

/*!
    \brief      configure ADC sequence stream counter value (API_ID(0x002DU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  counter: the stream counter, it can be 0x1~0x10000
    \param[out] none
    \retval     none
*/
void adc_stream_counter_value_config(uint32_t adc_periph, uint32_t adc_sequence, uint32_t counter)
{
    uint32_t reg;

