sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002DU), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002DU), ERR_PARAM_INVALID);
    } else if(NOT_ADC_STREAM_COUNTER_VALUE(counter)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002DU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure routine sequence stream counter value */
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            reg = ADC_RSTREAM(adc_periph);
            reg &= ~(uint32_t)ADC_RSTREAM_RSTREAMCNT;
            reg |= (uint32_t)(counter - 1U);
            ADC_RSTREAM(adc_periph) = reg;
        } else {
            /* configure inserted sequence stream counter value */
            reg = ADC_IxSTREAM(adc_periph, adc_sequence);
            reg &= ~(uint32_t)ADC_ISTREAM_ISTREAMCNT;
            reg |= (uint32_t)(counter - 1U);
            ADC_IxSTREAM(adc_periph, adc_sequence) = reg;
        }
    }
}

/*!
    \brief      configure ADC sequence stream mode reload (API_ID(0x002EU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void adc_stream_mode_reload_config(uint32_t adc_periph, uint32_t adc_sequence, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002EU), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002EU), ERR_PARAM_INVALID);
    } else if(NOT_ADC_ENABLE_DISABLE(newvalue)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
                ADC_RSTREAM(adc_periph) |= ((uint32_t)ADC_RSTREAM_RSTREAMAREN);
            } else {
                ADC_IxSTREAM(adc_periph, adc_sequence) |= ((uint32_t)ADC_ISTREAM_ISTREAMAREN);
            }
        } else {
            if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
                ADC_RSTREAM(adc_periph) &= ~((uint32_t)ADC_RSTREAM_RSTREAMAREN);
            } else {
                ADC_IxSTREAM(adc_periph, adc_sequence) &= ~((uint32_t)ADC_ISTREAM_ISTREAMAREN);
            }
        }
    }
}

/*!
    \brief      configure ADC self test (API_ID(0x002FU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void adc_selftest_configure(uint32_t adc_periph, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002FU), ERR_PERIPH);
    } else if(NOT_ADC_ENABLE_DISABLE(newvalue)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            ADC_STCFG(adc_periph) |= ADC_STCFG_STEN;
        } else {
            ADC_STCFG(adc_periph) &= ~ADC_STCFG_STEN;
        }
    }
}

/*!
    \brief      configure the selftest capacitive and supply sample time (API_ID(0x0030U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_selftest: select selftest mode
                only one parameter can be selected which is shown as below:
      \arg        ADC_SELFTEST_SUPPLY: supply self test
      \arg        ADC_SELFTEST_CAPACITIVE: capacitive self test
      \arg        ADC_SELFTEST_SUPPLY_CAPACITIVE: supply and capacitive
    \param[in]  csamp: sampling time for capacitive selftest, it can be 0~638
    \param[in]  ssamp: sampling time for supply selftest, it can be 0~638
    \param[out] none
    \retval     none
*/
void adc_selftest_sample_time_config(uint32_t adc_periph, uint32_t adc_selftest, uint32_t ssamp, uint32_t csamp)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0030U), ERR_PERIPH);
    } else if(NOT_ADC_SELFTEST_MODE(adc_selftest)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0030U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_SAMPLE_TIME(ssamp)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0030U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ADC_SAMPLE_TIME(csamp)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0030U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_SELFTEST_SUPPLY == adc_selftest) {
            /* configure self test supply sample time */
            ADC_STSAMPT(adc_periph) &= ~(uint32_t)(ADC_STSAMPT_SSPT);
            ADC_STSAMPT(adc_periph) |= (uint32_t)ssamp;
        } else if(ADC_SELFTEST_CAPACITIVE == adc_selftest) {
            /* configure self test capacitive sample time */
            ADC_STSAMPT(adc_periph) &= ~(uint32_t)ADC_STSAMPT_CSPT;
            ADC_STSAMPT(adc_periph) |= (uint32_t)(csamp << 16U);
        } else {
            /* configure self test capacitive and supply sample time */
            ADC_STSAMPT(adc_periph) &= ~(uint32_t)(ADC_STSAMPT_SSPT | ADC_STSAMPT_CSPT);
            ADC_STSAMPT(adc_periph) |= (uint32_t)(ssamp | (csamp << 16U));
        }
    }
}

/*!
    \brief      select the capacitive and supply selftest steps in one shot mode (API_ID(0x0031U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  st_step: select capacitive and supply selftest steps
                only one parameter can be selected which is shown as below:
      \arg        ADC_SELFTEST_SUPPLY_CAPACITIVE_STEP0: for supply or capacitive self test step 0
      \arg        ADC_SELFTEST_SUPPLY_CAPACITIVE_STEP1: for supply or capacitive self test step 1
      \arg        ADC_SELFTEST_SUPPLY_CAPACITIVE_STEP2: for supply or capacitive self test step 2
      \arg        ADC_SELFTEST_CAPACITIVE_STEP3: for capacitive self test step 3
      \arg        ADC_SELFTEST_CAPACITIVE_STEP4: for capacitive self test step 4
      \arg        ADC_SELFTEST_CAPACITIVE_STEP5: for capacitive self test step 5
      \arg        ADC_SELFTEST_CAPACITIVE_STEP6: for capacitive self test step 6
      \arg        ADC_SELFTEST_CAPACITIVE_STEP7: for capacitive self test step 7
    \param[out] none
    \retval     none
*/
void adc_selftest_step_select_in_oneshot_mode(uint32_t adc_periph, uint32_t st_step)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0031U), ERR_PERIPH);
    } else if(NOT_ADC_SELFTEST_STEP(st_step)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0031U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_STCFG(adc_periph) &= ~(uint32_t)(ADC_STCFG_STSSEL);
        ADC_STCFG(adc_periph) |= (uint32_t)st_step;
    }
}

/*!
    \brief      configure the self test mode (API_ID(0x0032U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_selftest: select selftest mode
                only one parameter can be selected which is shown as below:
      \arg        ADC_SELFTEST_SUPPLY: supply self test
      \arg        ADC_SELFTEST_CAPACITIVE: capacitive self test
      \arg        ADC_SELFTEST_SUPPLY_CAPACITIVE: supply and capacitive self test
    \param[out] none
    \retval     none
*/
void adc_selftest_mode_config(uint32_t adc_periph, uint32_t adc_selftest)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0032U), ERR_PERIPH);
    } else if(NOT_ADC_SELFTEST_MODE(adc_selftest)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0032U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_STCFG(adc_periph) &= ~(uint32_t)(ADC_STCFG_STMSEL);
        ADC_STCFG(adc_periph) |= (uint32_t)adc_selftest;
    }
}

/*!
    \brief      configure the self test execution rate in continous mode (API_ID(0x0033U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  st_rate: a self test step is executed after the routine sequence has been converted x times, x can be 1~256
    \param[out] none
    \retval     none
*/
void adc_selftest_rate_config(uint32_t adc_periph, uint32_t st_rate)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0033U), ERR_PERIPH);
    } else if(NOT_ADC_SELFTEST_RATE(st_rate)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0033U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_STCFG(adc_periph) &= ~(uint32_t)(ADC_STCFG_STEXER);
        ADC_STCFG(adc_periph) |= (uint32_t)((st_rate - 1U) << 16U);
    }
}

/*!
    \brief      read the self test error data (API_ID(0x0034U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  st_data: select read which selftest mode step data
                only one parameter can be selected which is shown as below:
      \arg        ADC_SELFTEST_SUPPLY_STEP0_DATA: error data of supply self test step 0
      \arg        ADC_SELFTEST_SUPPLY_STEP1_DATA: error data of supply self test step 1
      \arg        ADC_SELFTEST_SUPPLY_STEP2_DATA: error data of supply self test step 2
      \arg        ADC_SELFTEST_CAPACITIVE_STEP_DATA: error data of capacitive self test steps
    \param[out] none
    \retval     the error value: 0~0xFFF
*/
uint32_t adc_selftest_error_data_read(uint32_t adc_periph, uint32_t st_data)
{
    uint32_t data = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0034U), ERR_PERIPH);
    } else if(NOT_ADC_SELFTEST_STEP_DATA(st_data)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0034U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(st_data) {
        /* read error data of supply self  test step 0 */
        case ADC_SELFTEST_SUPPLY_STEP0_DATA:
            data = (uint32_t)((ADC_STEDATA1(adc_periph) & ADC_STEDATA1_SST0EDATA) >> 16U);
            break;
        /* read error data of supply self  test step 1 */
        case ADC_SELFTEST_SUPPLY_STEP1_DATA:
            data = (uint32_t)(ADC_STEDATA0(adc_periph) & ADC_STEDATA0_SST1EDATA);
            break;
        /* read error data of supply self  test step 2 */
        case ADC_SELFTEST_SUPPLY_STEP2_DATA:
            data = (uint32_t)((ADC_STEDATA0(adc_periph) & ADC_STEDATA0_SST2EDATA) >> 16U);
            break;
        /* read error data of capacitive self test step */
        case ADC_SELFTEST_CAPACITIVE_STEP_DATA:
            data = (uint32_t)(ADC_STEDATA1(adc_periph) & ADC_STEDATA1_CSTEDATA);
            break;
        default:
            break;
        }
    }
    return data;
}

/*!
    \brief      read the selftest data (API_ID(0x0035U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[out] none
    \retval     the conversion value: 0~0xFFF
*/
uint32_t adc_selftest_data_read(uint32_t adc_periph)
{
    uint32_t data = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0035U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        data = (uint32_t)(ADC_STDATA(adc_periph) & ADC_STDATA_STDATA);
    }
    return data;
}

/*!
    \brief      get the self test capacitive occurred error step (API_ID(0x0036U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[out] none
    \retval     error step: 0~0x7
*/
uint32_t adc_selftest_capacitive_error_step_get(uint32_t adc_periph)
{
    uint32_t step = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0036U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        step = (uint32_t)(ADC_STSTAT(adc_periph) & ADC_STSTAT_CSTESTP);
    }
    return step;
}

/*!
    \brief      get the self test which step converted result (API_ID(0x0037U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[out] none
    \retval     step: 0~0xF
*/
uint32_t adc_selftest_converted_step_get(uint32_t adc_periph)
{
    uint32_t step = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0037U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        step = (uint32_t)((ADC_STDATA(adc_periph) & ADC_STDATA_STSTP) >> 16U);
    }
    return step;
}

/*!
    \brief      get the status of self test previous conversion data whether was overwritten without read (API_ID(0x0038U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_selftest_overwrite_status_get(uint32_t adc_periph)
{
    FlagStatus reval = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0038U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != (ADC_STDATA(adc_periph) & ADC_STDATA_STOVWF)) {
            reval = SET;
        } else {
            /* illegal parameters */
        }
    }
    return reval;
}

/*!
    \brief      get the status of selftest whether new conversion data is available (API_ID(0x0039U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_selftest_conversion_data_available_get(uint32_t adc_periph)
{
    FlagStatus reval = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0039U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != (ADC_STDATA(adc_periph) & ADC_STDATA_STAVLB)) {
            reval = SET;
        } else {
            /* illegal parameters */
        }
    }
    return reval;
}

/*!
    \brief      configure the self test analog watchdog threshold value (API_ID(0x003AU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  st_sel: select self test mode
                only one parameter can be selected which is shown as below:
      \arg        ADC_SELFTEST_SUPPLY: supply self test
      \arg        ADC_SELFTEST_CAPACITIVE: capacitive self test
    \param[in]  st_step: select capacitive and supply selftest steps
                only one parameter can be selected which is shown as below:
      \arg        ADC_SELFTEST_SUPPLY_CAPACITIVE_STEP0: for supply or capacitive self test step 0
      \arg        ADC_SELFTEST_SUPPLY_CAPACITIVE_STEP1: for supply or capacitive self test step 1
      \arg        ADC_SELFTEST_SUPPLY_CAPACITIVE_STEP2: for supply or capacitive self test step 2
      \arg        ADC_SELFTEST_CAPACITIVE_STEP3: for capacitive self test step 3
      \arg        ADC_SELFTEST_CAPACITIVE_STEP4: for capacitive self test step 4
      \arg        ADC_SELFTEST_CAPACITIVE_STEP5: for capacitive self test step 5
      \arg        ADC_SELFTEST_CAPACITIVE_STEP6: for capacitive self test step 6
      \arg        ADC_SELFTEST_CAPACITIVE_STEP7: for capacitive self test step 7
    \param[in]  low_thl: low threshold value, between 0~0xFFF(just for supply self test step 1/2)
    \param[in]  high_thl: high threshold value, between 0~0xFFF(just for supply self test step 0/1 and capacitive steps)
    \param[out] none
    \retval     none
*/
void adc_selftest_analog_watchdog_step_threshold_config(uint32_t adc_periph, uint32_t st_sel, uint32_t st_step, uint32_t low_thl, uint32_t high_thl)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x003AU), ERR_PERIPH);
    } else if(NOT_ADC_SELFTEST_MODE_SUP_CAP(st_sel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x003AU), ERR_PARAM_INVALID);
    } else if(NOT_ADC_SELFTEST_STEP(st_step)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x003AU), ERR_PARAM_INVALID);
    } else if(NOT_ADC_SELFTEST_THRESHOLD(low_thl)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x003AU), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ADC_SELFTEST_THRESHOLD(high_thl)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x003AU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_SELFTEST_SUPPLY == st_sel) {
            switch(st_step) {
            case 0:
                ADC_SSTWDCFGx(adc_periph, st_step) &= ~(uint32_t)(ADC_SSTWDCFG_SSTWDHT);
                ADC_SSTWDCFGx(adc_periph, st_step) |= (uint32_t)(high_thl << 16U);
                break;
            case 1:
                ADC_SSTWDCFGx(adc_periph, st_step) &= ~(uint32_t)(ADC_SSTWDCFG_SSTWDLT | ADC_SSTWDCFG_SSTWDHT);
                ADC_SSTWDCFGx(adc_periph, st_step) |= (uint32_t)(low_thl | high_thl << 16U);
                break;
            case 2:
                ADC_SSTWDCFGx(adc_periph, st_step) &= ~(uint32_t)(ADC_SSTWDCFG_SSTWDLT);
                ADC_SSTWDCFGx(adc_periph, st_step) |= (uint32_t)(low_thl);
                break;
            default:
                break;
            }
        } else {
            if(st_step % 2U == 0U) {
                ADC_CSTWDCFGx(adc_periph, st_step / 2U) &= ~(uint32_t)(ADC_CSTWDCFG_CSTWDHT0);
                ADC_CSTWDCFGx(adc_periph, st_step / 2U) |= (uint32_t)(high_thl);
            } else {
                ADC_CSTWDCFGx(adc_periph, st_step / 2U) &= ~(uint32_t)(ADC_CSTWDCFG_CSTWDHT1);
                ADC_CSTWDCFGx(adc_periph, st_step / 2U) |= (uint32_t)(high_thl << 16U);
            }
        }
    }
}

/*!
    \brief      configure the self test analog watchdog (API_ID(0x003BU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  st_sel: select self test mode
                only one parameter can be selected which is shown as below:
      \arg        ADC_SELFTEST_SUPPLY: supply self test
      \arg        ADC_SELFTEST_CAPACITIVE: capacitive self test
    \param[in]  st_step: select capacitive and supply selftest steps
                only one parameter can be selected which is shown as below:
      \arg        ADC_SELFTEST_SUPPLY_CAPACITIVE_STEP0: for supply or capacitive self test step 0
      \arg        ADC_SELFTEST_SUPPLY_CAPACITIVE_STEP1: for supply or capacitive self test step 1
      \arg        ADC_SELFTEST_SUPPLY_CAPACITIVE_STEP2: for supply or capacitive self test step 2
      \arg        ADC_SELFTEST_CAPACITIVE_STEP3: for capacitive self test step 3
      \arg        ADC_SELFTEST_CAPACITIVE_STEP4: for capacitive self test step 4
      \arg        ADC_SELFTEST_CAPACITIVE_STEP5: for capacitive self test step 5
      \arg        ADC_SELFTEST_CAPACITIVE_STEP6: for capacitive self test step 6
      \arg        ADC_SELFTEST_CAPACITIVE_STEP7: for capacitive self test step 7
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void adc_selftest_analog_watchdog_config(uint32_t adc_periph, uint32_t st_sel, uint32_t st_step, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x003BU), ERR_PERIPH);
    } else if(NOT_ADC_SELFTEST_MODE_SUP_CAP(st_sel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x003BU), ERR_PARAM_INVALID);
    } else if(NOT_ADC_SELFTEST_STEP(st_step)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x003BU), ERR_PARAM_INVALID);
    } else if(NOT_ADC_ENABLE_DISABLE(newvalue)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x003BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            if(ADC_SELFTEST_SUPPLY == st_sel) {
                ADC_SSTWDCFGx(adc_periph, st_step) |= (uint32_t)ADC_SSTWDCFG_SSTWDEN;
            } else {
                if(st_step % 2U == 0U) {
                    ADC_CSTWDCFGx(adc_periph, st_step / 2U) |= (uint32_t)(ADC_CSTWDCFG_CSTWDEN0);
                } else {
                    ADC_CSTWDCFGx(adc_periph, st_step / 2U) |= (uint32_t)(ADC_CSTWDCFG_CSTWDEN1);
                }
            }
        } else {
            if(ADC_SELFTEST_SUPPLY == st_sel) {
                ADC_SSTWDCFGx(adc_periph, st_step) &= ~(uint32_t)ADC_SSTWDCFG_SSTWDEN;
            } else {
                if(st_step % 2U == 0U) {
                    ADC_CSTWDCFGx(adc_periph, st_step / 2U) &= ~(uint32_t)(ADC_CSTWDCFG_CSTWDEN0);
                } else {
                    ADC_CSTWDCFGx(adc_periph, st_step / 2U) &= ~(uint32_t)(ADC_CSTWDCFG_CSTWDEN1);
                }
            }
        }
    }
}

/*!
    \brief      configure the self test watchdog timer safe time (API_ID(0x003CU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  st_time: self test safe time
                only one parameter can be selected which is shown as below:
      \arg        ADC_SELFTEST_TIME_0_1MS: about 0.1ms at 15MHz ADC clock frequency
      \arg        ADC_SELFTEST_TIME_0_5MS: about 0.5ms at 15MHz ADC clock frequency
      \arg        ADC_SELFTEST_TIME_1MS: about 1ms at 15MHz ADC clock frequency
      \arg        ADC_SELFTEST_TIME_2MS: about 2ms at 15MHz ADC clock frequency
      \arg        ADC_SELFTEST_TIME_5MS: about 5ms at 15MHz ADC clock frequency
      \arg        ADC_SELFTEST_TIME_10MS: about 10ms at 15MHz ADC clock frequency
      \arg        ADC_SELFTEST_TIME_20MS: about 20ms at 15MHz ADC clock frequency
      \arg        ADC_SELFTEST_TIME_50MS: about 50ms at 15MHz ADC clock frequency
    \param[out] none
    \retval     none
*/
void adc_selftest_watchdog_timer_safe_time_config(uint32_t adc_periph, uint32_t st_time)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x003CU), ERR_PERIPH);
    } else if(NOT_ADC_SELFTEST_SAFE_TIME(st_time)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x003CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_STCFG(adc_periph) &= ~(uint32_t)(ADC_STCFG_STWDT);
        ADC_STCFG(adc_periph) |= (uint32_t)st_time;
    }
}

