sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.c
/*!
    \brief      configure ADC selftest watchdog timer (API_ID(0x003DU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  st_sel: select self test mode
                only one parameter can be selected which is shown as below:
      \arg        ADC_SELFTEST_SUPPLY: supply self test
      \arg        ADC_SELFTEST_CAPACITIVE: capacitive self test
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void adc_selftest_watchdog_timer_config(uint32_t adc_periph, uint32_t st_sel, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x003DU), ERR_PERIPH);
    } else if(NOT_ADC_SELFTEST_MODE_SUP_CAP(st_sel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x003DU), ERR_PARAM_INVALID);
    } else if(NOT_ADC_ENABLE_DISABLE(newvalue)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x003DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            if(ADC_SELFTEST_SUPPLY == st_sel) {
                ADC_SSTWDCFGx(adc_periph, 0U) |= (uint32_t)ADC_SSTWDCFG_SSTWDTEN;
            } else {
                ADC_CSTWDCFGx(adc_periph, 3U) |= (uint32_t)ADC_CSTWDCFG_CSTWDTEN;
            }
        } else {
            if(ADC_SELFTEST_SUPPLY == st_sel) {
                ADC_SSTWDCFGx(adc_periph, 0U) &= ~(uint32_t)ADC_SSTWDCFG_SSTWDTEN;
            } else {
                ADC_CSTWDCFGx(adc_periph, 3U) &= ~(uint32_t)ADC_CSTWDCFG_CSTWDTEN;
            }
        }
    }
}

/*!
    \brief      self test registers lock (API_ID(0x003EU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  state: lock or unlock
                only one parameter can be selected which is shown as below:
      \arg        ADC_SELFTEST_REGISTER_UNLOCK: self test registers unlock
      \arg        ADC_SELFTEST_REGISTER_LOCK: self test registers lock
    \param[out] none
    \retval     none
*/
void adc_selftest_config_lock(uint32_t adc_periph, uint32_t state)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x003EU), ERR_PERIPH);
    } else if(NOT_ADC_SELFTEST_LOCK(state)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x003EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_CTL(adc_periph) &= ~((uint32_t)ADC_CTL_STLK);
        ADC_CTL(adc_periph) |= state;
    }
}

/*!
    \brief      configure DAC to ADC loop test (API_ID(0x003FU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void adc_dac_looptest_config(uint32_t adc_periph, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x003FU), ERR_PERIPH);
    } else if(NOT_ADC_ENABLE_DISABLE(newvalue)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x003FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            ADC_DTALTCFG(adc_periph) |= ADC_DTALTCFG_LTEN;
        } else {
            ADC_DTALTCFG(adc_periph) &= ~ADC_DTALTCFG_LTEN;
        }
    }
}

/*!
    \brief      configure the DAC to ADC loop test threshold value (API_ID(0x0040U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  low_thl: low threshold value, between 0~0xFF
    \param[in]  high_thl: high threshold value, between 0~0xFF
    \param[out] none
    \retval     none
*/
void adc_dac_looptest_threshold_config(uint32_t adc_periph, uint32_t low_thl, uint32_t high_thl)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0040U), ERR_PERIPH);
    } else if(NOT_ADC_LOOPTEST_THRESHOLD(low_thl)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0040U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ADC_LOOPTEST_THRESHOLD(high_thl)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0040U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_DTALTCFG(adc_periph) &= ~(uint32_t)(ADC_DTALTCFG_LTLT | ADC_DTALTCFG_LTHT);
        ADC_DTALTCFG(adc_periph) |= (uint32_t)(low_thl | (high_thl << 16U));
    }
}

/*!
    \brief      select which DAC used to loop test (API_ID(0x0041U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  dac_select: select DAC
                only one parameter can be selected which is shown as below:
      \arg        NO_DAC_SELECT: do not select DAC
      \arg        DAC0_SELECT: select DAC0_OUT0 as ADC input
      \arg        DAC1_SELECT: select DAC1_OUT0 as ADC input
    \param[out] none
    \retval     none
*/
void adc_dac_looptest_dac_select(uint32_t adc_periph, uint32_t dac_select)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0041U), ERR_PERIPH);
    } else if(NOT_ADC_LOOPTEST_DAC(dac_select)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0041U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_DTALTCFG(adc_periph) &= ~(uint32_t)(ADC_DTALTCFG_DAC0SEL | ADC_DTALTCFG_DAC1SEL);
        ADC_DTALTCFG(adc_periph) |= (uint32_t)(dac_select);
    }
}

/*!
    \brief      get the ADC current state (API_ID(0x0042U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  state: the ADC state bits
                only one parameter can be selected which is shown as below:
      \arg        ADC_STATE_IDLE: ADC not work
      \arg        ADC_STATE_WAIT: ADC in conversion start delay state
      \arg        ADC_STATE_PSAMP: ADC in presampling state
      \arg        ADC_STATE_EDDLY: ADC in external decode signals delay state
      \arg        ADC_STATE_SAMP: ADC in sampling state
      \arg        ADC_STATE_CONV: ADC in converting state
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_current_state_get(uint32_t adc_periph, uint32_t state)
{
    FlagStatus reval = RESET;

