sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0042U), ERR_PERIPH);
    } else if(NOT_ADC_STATE(state)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0042U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if((ADC_STAT(adc_periph) & ADC_STAT_ADCSTAT) == state) {
            reval = SET;
        } else {
            /* illegal parameters */
        }
    }
    return reval;
}

/*!
    \brief      get the ADC current active sequence (API_ID(0x0043U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[out] none
    \retval     sequence number: 0~0x7
*/
uint32_t adc_active_sequence_get(uint32_t adc_periph)
{
    uint32_t group_num = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0043U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        group_num = (uint32_t)((ADC_STAT(adc_periph) & ADC_STAT_ACTSQ) >> 3U);
    }
    return group_num;
}

/*!
    \brief      get the ADC current active channel (API_ID(0x0044U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[out] none
    \retval     channel number: 0~61
*/
uint32_t adc_active_channel_get(uint32_t adc_periph)
{
    uint32_t channel_num = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0044U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        channel_num = (uint32_t)((ADC_STAT(adc_periph) & ADC_STAT_ACTCH) >> 8U);
    }
    return channel_num;
}

/*!
    \brief      get which channel converted this conversion data in channel register (API_ID(0x0045U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  rank: the sequence rank, routine sequence is 0 to 27(ADC2 just supports 0 to 23), and inserted sequence is 0 to 3
    \param[out] none
    \retval     the channel num: 0~61
*/
uint32_t adc_channel_converted_channel_get(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank)
{
    uint32_t data = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0045U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0045U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_SEQUENCE_RANK(rank)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0045U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            data = (uint32_t)((ADC_RCHDATAx(adc_periph, rank) & ADC_RCHDATA_RCH) >> 16U);
        } else {
            data = (uint32_t)((ADC_IxCHDATAy(adc_periph, adc_sequence, rank) & ADC_ICHDATA_ICH) >> 16U);
        }
    }
    return data;
}

/*!
    \brief      get whether the previous conversion data was overwritten without read in channel register (API_ID(0x0046U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  rank: the sequence rank, routine sequence is 0 to 27(ADC2 just supports 0 to 23), and inserted sequence is 0 to 3
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_channel_overwrite_status_get(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank)
{
    FlagStatus reval = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0046U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0046U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_SEQUENCE_RANK(rank)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0046U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            if(0U != (ADC_RCHDATAx(adc_periph, rank) & ADC_RCHDATA_RCHOVWF)){
                reval = SET;
            } else {
                /* illegal parameters */
            }
        } else {
            if(0U != (ADC_IxCHDATAy(adc_periph, adc_sequence, rank) & ADC_ICHDATA_ICHOVWF)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        }
    }
    return reval;
}

/*!
    \brief      get whether the new conversion data is available in channel register (API_ID(0x0047U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  rank: the sequence rank, routine sequence is 0 to 27(ADC2 just supports 0 to 23), and inserted sequence is 0 to 3
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_channel_conversion_data_available_get(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank)
{
    FlagStatus reval = RESET;

