sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0047U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0047U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_SEQUENCE_RANK(rank)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0047U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            if(0U != (ADC_RCHDATAx(adc_periph, rank) & ADC_RCHDATA_RCHAVLB)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        } else {
            if(0U != (ADC_IxCHDATAy(adc_periph, adc_sequence, rank) & ADC_ICHDATA_ICHAVLB)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        }
    }
    return reval;
}

/*!
    \brief      get which channel converted this conversion data in sequence register (API_ID(0x0048U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[out] none
    \retval     the channel num: 0~61
*/
uint32_t adc_sequence_converted_channel_get(uint32_t adc_periph, uint32_t adc_sequence)
{
    uint32_t data = 0U;
    
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0048U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0048U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            data = (uint32_t)((ADC_RDATA(adc_periph) & ADC_RDATA_RSQCH) >> 16U);
        } else {
            data = (uint32_t)((ADC_IxDATA(adc_periph, adc_sequence) & ADC_IDATA_ISQCH) >> 16U);
        }
    }
    
    return data;
}

/*!
    \brief      get whether the previous conversion data was overwritten without read in sequence register (API_ID(0x0049U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_sequence_overwrite_status_get(uint32_t adc_periph, uint32_t adc_sequence)
{
    FlagStatus reval = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0049U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0049U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            if(0U != (ADC_RDATA(adc_periph) & ADC_RDATA_ROVWF)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        } else {
            if(0U != (ADC_IxDATA(adc_periph, adc_sequence) & ADC_IDATA_IOVWF)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        }
    }
    return reval;
}

/*!
    \brief      get whether the new conversion data is available in sequence register (API_ID(0x004AU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_sequence_conversion_data_available_get(uint32_t adc_periph, uint32_t adc_sequence)
{
    FlagStatus reval = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x004AU), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x004AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            if(0U != (ADC_RDATA(adc_periph) & ADC_RDATA_RAVLB)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        } else {
            if(0U != (ADC_IxDATA(adc_periph, adc_sequence) & ADC_IDATA_IAVLB)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        }
    }
    return reval;
}

/*!
    \brief      get ADC flag (API_ID(0x004BU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  flag: the ADC flag bits
                only one parameter can be selected which is shown as below:
      \arg        ADC_FLAG_ACTST: self test ongoing flag
      \arg        ADC_FLAG_EORC: end of routine sequence conversion flag
      \arg        ADC_FLAG_EOI0C: end of inserted sequence 0 conversion flag
      \arg        ADC_FLAG_EOI1C: end of inserted sequence 1 conversion flag
      \arg        ADC_FLAG_EOI2C: end of inserted sequence 2 conversion flag
      \arg        ADC_FLAG_EOI3C: end of inserted sequence 3 conversion flag
      \arg        ADC_FLAG_EOI4C: end of inserted sequence 4 conversion flag
      \arg        ADC_FLAG_EOI5C: end of inserted sequence 5 conversion flag
      \arg        ADC_FLAG_EORCHC: end of routine sequence channel conversion flag
      \arg        ADC_FLAG_EOI0CHC: end of inserted sequence 0 channel conversion flag
      \arg        ADC_FLAG_EOI1CHC: end of inserted sequence 1 channel conversion flag
      \arg        ADC_FLAG_EOI2CHC: end of inserted sequence 2 channel conversion flag
      \arg        ADC_FLAG_EOI3CHC: end of inserted sequence 3 channel conversion flag
      \arg        ADC_FLAG_EOI4CHC: end of inserted sequence 4 channel conversion flag
      \arg        ADC_FLAG_EOI5CHC: end of inserted sequence 5 channel conversion flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_flag_get(uint32_t adc_periph, uint32_t flag)
{
    FlagStatus reval = RESET;

