sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x004BU), ERR_PERIPH);
    } else if(NOT_ADC_FLAG(flag)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x004BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != (ADC_STAT(adc_periph) & flag)) {
            reval = SET;
        } else {
            /* illegal parameters */
        }
    }
    return reval;
}

/*!
    \brief      get ADC error flag (API_ID(0x004CU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  flag: the ADC error flag bits
                only one parameter can be selected which is shown as below:
      \arg        ADC_FLAG_RSUSPDF: routine sequence hold flag
      \arg        ADC_FLAG_RABORTF: routine sequence aborted flag
      \arg        ADC_FLAG_RTRGE: routine sequence trigger error flag
      \arg        ADC_FLAG_I0SUSPDF: inserted sequence 0 suspended flag
      \arg        ADC_FLAG_I0ABORTF: inserted sequence 0 aborted flag
      \arg        ADC_FLAG_I0TRGE: inserted sequence 0 trigger error flag
      \arg        ADC_FLAG_I1SUSPDF: inserted sequence 1 suspended flag
      \arg        ADC_FLAG_I1ABORTF: inserted sequence 1 aborted flag
      \arg        ADC_FLAG_I1TRGE: inserted sequence 1 trigger error flag
      \arg        ADC_FLAG_I2SUSPDF: inserted sequence 2 suspended flag
      \arg        ADC_FLAG_I2ABORTF: inserted sequence 2 aborted flag
      \arg        ADC_FLAG_I2TRGE: inserted sequence 2 trigger error flag
      \arg        ADC_FLAG_I3SUSPDF: inserted sequence 3 suspended flag
      \arg        ADC_FLAG_I3ABORTF: inserted sequence 3 aborted flag
      \arg        ADC_FLAG_I3TRGE: inserted sequence 3 trigger error flag
      \arg        ADC_FLAG_I4SUSPDF: inserted sequence 4 suspended flag
      \arg        ADC_FLAG_I4ABORTF: inserted sequence 4 aborted flag
      \arg        ADC_FLAG_I4TRGE: inserted sequence 4 trigger error flag
      \arg        ADC_FLAG_I5ABORTF: inserted sequence 5 aborted flag
      \arg        ADC_FLAG_I5TRGE: inserted sequence 5 trigger error flag
      \arg        ADC_FLAG_WDE: analog watchdog flag
      \arg        ADC_FLAG_LTE: DAC - ADC loop test error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_error_flag_get(uint32_t adc_periph, uint32_t error_flag)
{
    FlagStatus reval = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x004CU), ERR_PERIPH);
    } else if(NOT_ADC_ERROR_FLAG(error_flag)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x004CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_FLAG_LTE == error_flag) {
            if(0U != (ADC_DTALTCFG(adc_periph) & ADC_DTALTCFG_LTE)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        } else {
            if(0U != (ADC_ESTAT(adc_periph) & error_flag)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        }
    }
    return reval;
}

/*!
    \brief      clear ADC flag (API_ID(0x004DU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  flag: the ADC flag bits
                only one parameter can be selected which is shown as below:
      \arg        ADC_FLAG_ACTST: self test ongoing flag
      \arg        ADC_FLAG_EORC: end of routine sequence conversion flag
      \arg        ADC_FLAG_EOI0C: end of inserted sequence 0 conversion flag
      \arg        ADC_FLAG_EOI1C: end of inserted sequence 1 conversion flag
      \arg        ADC_FLAG_EOI2C: end of inserted sequence 2 conversion flag
      \arg        ADC_FLAG_EOI3C: end of inserted sequence 3 conversion flag
      \arg        ADC_FLAG_EOI4C: end of inserted sequence 4 conversion flag
      \arg        ADC_FLAG_EOI5C: end of inserted sequence 5 conversion flag
      \arg        ADC_FLAG_EORCHC: end of routine sequence channel conversion flag
      \arg        ADC_FLAG_EOI0CHC: end of inserted sequence 0 channel conversion flag
      \arg        ADC_FLAG_EOI1CHC: end of inserted sequence 1 channel conversion flag
      \arg        ADC_FLAG_EOI2CHC: end of inserted sequence 2 channel conversion flag
      \arg        ADC_FLAG_EOI3CHC: end of inserted sequence 3 channel conversion flag
      \arg        ADC_FLAG_EOI4CHC: end of inserted sequence 4 channel conversion flag
      \arg        ADC_FLAG_EOI5CHC: end of inserted sequence 5 channel conversion flag
    \param[out] none
    \retval     none
*/
void adc_flag_clear(uint32_t adc_periph, uint32_t flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x004DU), ERR_PERIPH);
    } else if(NOT_ADC_FLAG(flag)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x004DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_STAT(adc_periph) = ~(uint32_t)flag;
    }
}

/*!
    \brief      clear ADC error flag (API_ID(0x004EU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  error_flag: the ADC error flag bits
                only one parameter can be selected which is shown as below:
      \arg        ADC_FLAG_RABORTF: sequence aborted flag
      \arg        ADC_FLAG_RTRGE: routine sequence trigger error flag
      \arg        ADC_FLAG_I0ABORTF: inserted sequence 0 aborted flag
      \arg        ADC_FLAG_I0TRGE: inserted sequence 0 trigger error flag
      \arg        ADC_FLAG_I1ABORTF: inserted sequence 1 aborted flag
      \arg        ADC_FLAG_I1TRGE: inserted sequence 1 trigger error flag
      \arg        ADC_FLAG_I2ABORTF: inserted sequence 2 aborted flag
      \arg        ADC_FLAG_I2TRGE: inserted sequence 2 trigger error flag
      \arg        ADC_FLAG_I3ABORTF: inserted sequence 3 aborted flag
      \arg        ADC_FLAG_I3TRGE: inserted sequence 3 trigger error flag
      \arg        ADC_FLAG_I4ABORTF: inserted sequence 4 aborted flag
      \arg        ADC_FLAG_I4TRGE: inserted sequence 4 trigger error flag
      \arg        ADC_FLAG_I5ABORTF: inserted sequence 5 aborted flag
      \arg        ADC_FLAG_I5TRGE: inserted sequence 5 trigger error flag
      \arg        ADC_FLAG_WDE: analog watchdog interrupt flag
      \arg        ADC_FLAG_LTE: DAC - ADC loop test error flag
    \param[out] none
    \retval     none
*/
void adc_error_flag_clear(uint32_t adc_periph, uint32_t error_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x004EU), ERR_PERIPH);
    } else if(NOT_ADC_ERROR_FLAG(error_flag)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x004EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_FLAG_LTE == error_flag) {
            ADC_DTALTCFG(adc_periph) &= ~(uint32_t)ADC_DTALTCFG_LTE;
        } else {
            ADC_ESTAT(adc_periph) = ~(uint32_t)error_flag;
        }
    }
}

/*!
    \brief      enable ADC interrupt (API_ID(0x004FU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  inserted_sequence: select the inserted sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_INSERTED_SEQUENCE_NONE: none inserted sequence (only for ADC_INT_RTRGEIE, ADC_INT_EORCIE, ADC_INT_RSTREAMIE, ADC_INT_ANALOG_WATCHDOG0,
                                              ADC_INT_ANALOG_WATCHDOG1, ADC_INT_ANALOG_WATCHDOG2, ADC_INT_ANALOG_WATCHDOG3 and ADC_INT_LOOPTEST)
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0 (only for ADC_INT_ITRGEIE, ADC_INT_IEOCIE and ADC_INT_ISTREAMIE)
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1 (only for ADC_INT_ITRGEIE, ADC_INT_IEOCIE and ADC_INT_ISTREAMIE)
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2 (only for ADC_INT_ITRGEIE, ADC_INT_IEOCIE and ADC_INT_ISTREAMIE)
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3 (only for ADC_INT_ITRGEIE, ADC_INT_IEOCIE and ADC_INT_ISTREAMIE)
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4 (only for ADC_INT_ITRGEIE, ADC_INT_IEOCIE and ADC_INT_ISTREAMIE)
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5 (only for ADC_INT_ITRGEIE, ADC_INT_IEOCIE and ADC_INT_ISTREAMIE)
    \param[in]  interrupt: the ADC interrupt
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_RTRGEIE: routine sequence trigger error interrupt
      \arg        ADC_INT_EORCIE: routine sequence end conversion interrupt
      \arg        ADC_INT_RSTREAMIE: routine sequence stream mode interrupt
      \arg        ADC_INT_ITRGEIE: inserted sequence trigger error interrupt
      \arg        ADC_INT_IEOCIE: inserted sequence end conversion interrupt
      \arg        ADC_INT_ISTREAMIE: inserted sequence stream mode interrupt
      \arg        ADC_INT_ANALOG_WATCHDOG0: analog watchdog 0 interrupt
      \arg        ADC_INT_ANALOG_WATCHDOG1: analog watchdog 1 interrupt
      \arg        ADC_INT_ANALOG_WATCHDOG2: analog watchdog 2 interrupt
      \arg        ADC_INT_ANALOG_WATCHDOG3: analog watchdog 3 interrupt
      \arg        ADC_INT_LOOPTEST: DAC to ADC loop test error interrupt
      \arg        ADC_INT_OVERWRITE: sequence overwrite interrupt
      \arg        ADC_INT_CHOVERWRITE: Channel overwrite interrupt interrupt
    \param[out] none
    \retval     none
*/
void adc_interrupt_enable(uint32_t adc_periph, uint32_t inserted_sequence, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x004FU), ERR_PERIPH);
    } else if(NOT_ADC_INSERTED_SEQUENCE(inserted_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x004FU), ERR_PARAM_INVALID);
    } else if(NOT_ADC_INTERRUPT(interrupt)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x004FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(interrupt) {
        /* enable routine trigger specified when sequence is convering interrupt */
        case ADC_INT_RTRGEIE:
            ADC_RCTL(adc_periph) |= (uint32_t)ADC_RCTL_RTRGEIE;
            break;
        /* enable routine sequence sequence end of conversion interrupt */
        case ADC_INT_EORCIE:
            ADC_RCTL(adc_periph) |= (uint32_t)ADC_RCTL_EORCIE;
            break;
        case ADC_INT_RSTREAMIE:
            ADC_RSTREAM(adc_periph) |= ((uint32_t)ADC_RSTREAM_RSTREAMIE);
            break;
        /* enable inserted trigger specified when sequence is convering interrupt */
        case ADC_INT_ITRGEIE:
            ADC_IxCTL(adc_periph, inserted_sequence) |= (uint32_t)ADC_ICTL_ITRGEIE;
            break;
        /* enable inserted sequence sequence end of conversion interrupt */
        case ADC_INT_IEOCIE:
            ADC_IxCTL(adc_periph, inserted_sequence) |= (uint32_t)ADC_ICTL_IEOCIE;
            break;
        /* enable inserted sequence stream mode interrupt */
        case ADC_INT_ISTREAMIE:
            ADC_IxSTREAM(adc_periph, inserted_sequence) |= ((uint32_t)ADC_ISTREAM_ISTREAMIE);
            break;
        /* enable analog watchdog 0 interrupt */
        case ADC_INT_ANALOG_WATCHDOG0:
            ADC_WDTx(adc_periph, ADC_ANALOG_WATCHDOG0) |= (uint32_t)ADC_WDT_WDEIE;
            break;
        /* enable analog watchdog 1 interrupt */
        case ADC_INT_ANALOG_WATCHDOG1:
            ADC_WDTx(adc_periph, ADC_ANALOG_WATCHDOG1) |= (uint32_t)ADC_WDT_WDEIE;
            break;
        /* enable analog watchdog 2 interrupt */
        case ADC_INT_ANALOG_WATCHDOG2:
            ADC_WDTx(adc_periph, ADC_ANALOG_WATCHDOG2) |= (uint32_t)ADC_WDT_WDEIE;
            break;
        /* enable analog watchdog 3 interrupt */
        case ADC_INT_ANALOG_WATCHDOG3:
            ADC_WDTx(adc_periph, ADC_ANALOG_WATCHDOG3) |= (uint32_t)ADC_WDT_WDEIE;
            break;
        /* enable DAC to ADC loop test error interrupt */
        case ADC_INT_LOOPTEST:
            ADC_DTALTCFG(adc_periph) |= ADC_DTALTCFG_LTEIE;
            break;
        /* enable sequence overwrite interrupt */
        case ADC_INT_OVERWRITE:
            ADC_CTL(adc_periph) |= ADC_CTL_OVWIE;
            break;
        /* enable Channel overwrite interrupt interrupt */
        case ADC_INT_CHOVERWRITE:
            ADC_CTL(adc_periph) |= ADC_CTL_CHOVWIE;
            break;

        default:
            break;
        }
    }
}

/*!
    \brief      disable ADC interrupt (API_ID(0x0050U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  inserted_sequence: select the inserted sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_INSERTED_SEQUENCE_NONE: none inserted sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  interrupt: the ADC interrupt
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_RTRGEIE: routine sequence trigger error interrupt
      \arg        ADC_INT_EORCIE: routine sequence end conversion interrupt
      \arg        ADC_INT_RSTREAMIE: routine sequence stream mode interrupt
      \arg        ADC_INT_ITRGEIE: inserted sequence trigger error interrupt
      \arg        ADC_INT_IEOCIE: inserted sequence end conversion interrupt
      \arg        ADC_INT_ISTREAMIE: inserted sequence stream mode interrupt
      \arg        ADC_INT_ANALOG_WATCHDOG0: analog watchdog 0 interrupt
      \arg        ADC_INT_ANALOG_WATCHDOG1: analog watchdog 1 interrupt
      \arg        ADC_INT_ANALOG_WATCHDOG2: analog watchdog 2 interrupt
      \arg        ADC_INT_ANALOG_WATCHDOG3: analog watchdog 3 interrupt
      \arg        ADC_INT_LOOPTEST: DAC to ADC loop test error interrupt
      \arg        ADC_INT_OVERWRITE: sequence overwrite interrupt
      \arg        ADC_INT_CHOVERWRITE: Channel overwrite interrupt interrupt
    \param[out] none
    \retval     none
*/
void adc_interrupt_disable(uint32_t adc_periph, uint32_t inserted_sequence, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0050U), ERR_PERIPH);
    } else if(NOT_ADC_INSERTED_SEQUENCE(inserted_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0050U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_INTERRUPT(interrupt)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0050U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(interrupt) {
        /* disable routine trigger specified when sequence is convering interrupt */
        case ADC_INT_RTRGEIE:
            ADC_RCTL(adc_periph) &= ~(uint32_t)ADC_RCTL_RTRGEIE;
            break;
        /* disable routine sequence sequence end of conversion interrupt */
        case ADC_INT_EORCIE:
            ADC_RCTL(adc_periph) &= ~(uint32_t)ADC_RCTL_EORCIE;
            break;
        case ADC_INT_RSTREAMIE:
            ADC_RSTREAM(adc_periph) &= ~((uint32_t)ADC_RSTREAM_RSTREAMIE);
            break;
        /* disable inserted trigger specified when sequence is convering interrupt */
        case ADC_INT_ITRGEIE:
            ADC_IxCTL(adc_periph, inserted_sequence) &= ~(uint32_t)ADC_ICTL_ITRGEIE;
            break;
        /* disable inserted sequence sequence end of conversion interrupt */
        case ADC_INT_IEOCIE:
            ADC_IxCTL(adc_periph, inserted_sequence) &= ~(uint32_t)ADC_ICTL_IEOCIE;
            break;
        /* disable inserted sequence stream mode interrupt */
        case ADC_INT_ISTREAMIE:
            ADC_IxSTREAM(adc_periph, inserted_sequence) &= ~((uint32_t)ADC_ISTREAM_ISTREAMIE);
            break;
        /* disable analog watchdog 0 interrupt */
        case ADC_INT_ANALOG_WATCHDOG0:
            ADC_WDTx(adc_periph, ADC_ANALOG_WATCHDOG0) &= (uint32_t)(~ADC_WDT_WDEIE);
            break;
        /* disable analog watchdog 1 interrupt */
        case ADC_INT_ANALOG_WATCHDOG1:
            ADC_WDTx(adc_periph, ADC_ANALOG_WATCHDOG1) &= (uint32_t)(~ADC_WDT_WDEIE);
            break;
        /* disable analog watchdog 2 interrupt */
        case ADC_INT_ANALOG_WATCHDOG2:
            ADC_WDTx(adc_periph, ADC_ANALOG_WATCHDOG2) &= (uint32_t)(~ADC_WDT_WDEIE);
            break;
        /* disable analog watchdog 3 interrupt */
        case ADC_INT_ANALOG_WATCHDOG3:
            ADC_WDTx(adc_periph, ADC_ANALOG_WATCHDOG3) &= (uint32_t)(~ADC_WDT_WDEIE);
            break;
        /* disable DAC to ADC loop test error interrupt */
        case ADC_INT_LOOPTEST:
            ADC_DTALTCFG(adc_periph) &= ~ADC_DTALTCFG_LTEIE;
            break;
        /* disable sequence overwrite interrupt */
        case ADC_INT_OVERWRITE:
            ADC_CTL(adc_periph) &= ~ADC_CTL_OVWIE;
            break;
        /* disable Channel overwrite interrupt interrupt */
        case ADC_INT_CHOVERWRITE:
            ADC_CTL(adc_periph) &= ~ADC_CTL_CHOVWIE;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      get the ADC interrupt flag (API_ID(0x0051U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  int_flag: the ADC interrupt flag bits
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_FLAG_EORC:  end of routine sequence conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI0C: end of inserted sequence 0 conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI1C: end of inserted sequence 1 conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI2C: end of inserted sequence 2 conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI3C: end of inserted sequence 3 conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI4C: end of inserted sequence 4 conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI5C: end of inserted sequence 5 conversion interrupt flag
      \arg        ADC_INT_FLAG_EORCHC:  end of routine sequence channel conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI0CHC: end of inserted sequence 0 channel conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI1CHC: end of inserted sequence 0 channel conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI2CHC: end of inserted sequence 2 channel conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI3CHC: end of inserted sequence 3 channel conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI4CHC: end of inserted sequence 4 channel conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI5CHC: end of inserted sequence 5 channel conversion interrupt flag
      \arg        ADC_INT_FLAG_RTRGE: routine sequence trigger error interrupt flag
      \arg        ADC_INT_FLAG_I0TRGE: inserted sequence 0 trigger error interrupt flag
      \arg        ADC_INT_FLAG_I1TRGE: inserted sequence 1 trigger error interrupt flag
      \arg        ADC_INT_FLAG_I2TRGE: inserted sequence 2 trigger error interrupt flag
      \arg        ADC_INT_FLAG_I3TRGE: inserted sequence 3 trigger error interrupt flag
      \arg        ADC_INT_FLAG_I4TRGE: inserted sequence 4 trigger error interrupt flag
      \arg        ADC_INT_FLAG_I5TRGE: inserted sequence 5 trigger error interrupt flag
      \arg        ADC_INT_FLAG_LTE: DAC - ADC loop test error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_interrupt_flag_get(uint32_t adc_periph, uint32_t int_flag)
{
    uint32_t reg1 = ADC_STAT(adc_periph);
    uint32_t reg3 = ADC_ESTAT(adc_periph);
    uint32_t reg2 = 0U;
    FlagStatus reval = RESET;

