sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0051U), ERR_PERIPH);
    } else if(NOT_ADC_INTERRUPT_FLAG(int_flag)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0051U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(int_flag) {
        /* ADC routine end of sequence conversion interrupt */
        case ADC_INT_FLAG_EORC:{
            reg1 = reg1 & ADC_STAT_EORC;
            reg2 = ADC_RCTL(adc_periph) & ADC_RCTL_EORCIE;
            break;
        }
        /* ADC inserted sequence0 end of sequence conversion interrupt */
        case ADC_INT_FLAG_EOI0C:{
            reg1 = reg1 & ADC_STAT_EOI0C;
            reg2 = ADC_IxCTL(adc_periph, 0U) & ADC_ICTL_IEOCIE;
            break;
        }
        /* ADC inserted sequence1 end of sequence conversion interrupt */
        case ADC_INT_FLAG_EOI1C:{
            reg1 = reg1 & ADC_STAT_EOI1C;
            reg2 = ADC_IxCTL(adc_periph, 1U) & ADC_ICTL_IEOCIE;
            break;
        }
        /* ADC inserted sequence2 end of sequence conversion interrupt */
        case ADC_INT_FLAG_EOI2C:{
            reg1 = reg1 & ADC_STAT_EOI2C;
            reg2 = ADC_IxCTL(adc_periph, 2U) & ADC_ICTL_IEOCIE;
            break;
        }
        /* ADC inserted sequence3 end of sequence conversion interrupt */
        case ADC_INT_FLAG_EOI3C:{
            reg1 = reg1 & ADC_STAT_EOI3C;
            reg2 = ADC_IxCTL(adc_periph, 3U) & ADC_ICTL_IEOCIE;
            break;
        }
        /* ADC inserted sequence4 end of sequence conversion interrupt */
        case ADC_INT_FLAG_EOI4C:{
            reg1 = reg1 & ADC_STAT_EOI4C;
            reg2 = ADC_IxCTL(adc_periph, 4U) & ADC_ICTL_IEOCIE;
            break;
        }
        /* ADC inserted sequence5 end of sequence conversion interrupt */
        case ADC_INT_FLAG_EOI5C:{
            reg1 = reg1 & ADC_STAT_EOI5C;
            reg2 = ADC_IxCTL(adc_periph, 5U) & ADC_ICTL_IEOCIE;
            break;
        }
        /* ADC routine sequence end of channel conversion interrupt */
        case ADC_INT_FLAG_EORCHC:{
            reg1 = reg1 & ADC_STAT_EORCHC;
            reg2 = 0U;
            for(uint32_t i = 0U; i < 28U; i++) {
                if(0U != (ADC_RCFGx(adc_periph, i) & ((uint32_t)ADC_RCFG_RCHIE))) {
                    reg2 = 1U;
                    break;
                } else {
                    /* illegal parameters */
                }
            }
            break;
        }
        /* ADC inserted sequence0 end of channel conversion interrupt */
        case ADC_INT_FLAG_EOI0CHC:{
            reg1 = reg1 & ADC_STAT_EOI0CHC;
            reg2 = 0U;
            for(uint32_t i = 0U; i < 4U; i++) {
                if(0U != (ADC_IxCFGy(adc_periph, 0U, i) & ((uint32_t)ADC_ICFG_ICHIE))) {
                    reg2 = 1U;
                    break;
                } else {
                    /* illegal parameters */
                }
            }
            break;
        }
        /* ADC inserted sequence1 end of channel conversion interrupt */
        case ADC_INT_FLAG_EOI1CHC:{
            reg1 = reg1 & ADC_STAT_EOI1CHC;
            reg2 = 0U;
            for(uint32_t i = 0U; i < 4U; i++) {
                if(0U != (ADC_IxCFGy(adc_periph, 1U, i) & ((uint32_t)ADC_ICFG_ICHIE))) {
                    reg2 = 1U;
                    break;
                } else {
                    /* illegal parameters */
                }
            }
            break;
        }
        /* ADC inserted sequence2 end of channel conversion interrupt */
        case ADC_INT_FLAG_EOI2CHC:{
            reg1 = reg1 & ADC_STAT_EOI2CHC;
            reg2 = 0U;
            for(uint32_t i = 0U; i < 4U; i++) {
                if(0U != (ADC_IxCFGy(adc_periph, 2U, i) & ((uint32_t)ADC_ICFG_ICHIE))) {
                    reg2 = 1U;
                    break;
                } else {
                    /* illegal parameters */
                }
            }
            break;
        }
        /* ADC inserted sequence3 end of channel conversion interrupt */
        case ADC_INT_FLAG_EOI3CHC:{
            reg1 = reg1 & ADC_STAT_EOI3CHC;
            reg2 = 0U;
            for(uint32_t i = 0U; i < 4U; i++) {
                if(0U != (ADC_IxCFGy(adc_periph, 3U, i) & ((uint32_t)ADC_ICFG_ICHIE))) {
                    reg2 = 1U;
                    break;
                } else {
                    /* illegal parameters */
                }
            }
            break;
        }
        /* ADC inserted sequence4 end of channel conversion interrupt */
        case ADC_INT_FLAG_EOI4CHC:{
            reg1 = reg1 & ADC_STAT_EOI4CHC;
            reg2 = 0U;
            for(uint32_t i = 0U; i < 4U; i++) {
                if(0U != (ADC_IxCFGy(adc_periph, 4U, i) & ((uint32_t)ADC_ICFG_ICHIE))) {
                    reg2 = 1U;
                    break;
                } else {
                    /* illegal parameters */
                }
            }
            break;
        }
        /* ADC inserted sequence0 end of channel conversion interrupt */
        case ADC_INT_FLAG_EOI5CHC:{
            reg1 = reg1 & ADC_STAT_EOI5CHC;
            reg2 = 0U;
            for(uint32_t i = 0U; i < 4U; i++) {
                if(0U != (ADC_IxCFGy(adc_periph, 5U, i) & ((uint32_t)ADC_ICFG_ICHIE))) {
                    reg2 = 1U;
                    break;
                } else {
                    /* illegal parameters */
                }
            }
            break;
        }
        /* ADC routine sequence trigger error interrupt */
        case ADC_INT_FLAG_RTRGE:{
            reg3 = reg3 & ADC_ESTAT_RTRGE;
            reg1 = reg3;
            reg2 = ADC_RCTL(adc_periph) & ADC_RCTL_RTRGEIE;
            break;
        }
        /* ADC inserted sequence0 trigger error interrupt */
        case ADC_INT_FLAG_I0TRGE:{
            reg3 = reg3 & ADC_ESTAT_I0TRGE;
            reg1 = reg3;
            reg2 = ADC_IxCTL(adc_periph, 0U) & ADC_ICTL_ITRGEIE;
            break;
        }
        /* ADC inserted sequence1 trigger error interrupt */
        case ADC_INT_FLAG_I1TRGE:{
            reg3 = reg3 & ADC_ESTAT_I1TRGE;
            reg1 = reg3;
            reg2 = ADC_IxCTL(adc_periph, 1U) & ADC_ICTL_ITRGEIE;
            break;
        }
        /* ADC inserted sequence2 trigger error interrupt */
        case ADC_INT_FLAG_I2TRGE:{
            reg3 = reg3 & ADC_ESTAT_I2TRGE;
            reg1 = reg3;
            reg2 = ADC_IxCTL(adc_periph, 2U) & ADC_ICTL_ITRGEIE;
            break;
        }
        /* ADC inserted sequence3 trigger error interrupt */
        case ADC_INT_FLAG_I3TRGE:{
            reg3 = reg3 & ADC_ESTAT_I3TRGE;
            reg1 = reg3;
            reg2 = ADC_IxCTL(adc_periph, 3U) & ADC_ICTL_ITRGEIE;
            break;
        }
        /* ADC inserted sequence4 trigger error interrupt */
        case ADC_INT_FLAG_I4TRGE:{
            reg3 = reg3 & ADC_ESTAT_I4TRGE;
            reg1 = reg3;
            reg2 = ADC_IxCTL(adc_periph, 4U) & ADC_ICTL_ITRGEIE;
            break;
        }
        /* ADC inserted sequence5 trigger error interrupt */
        case ADC_INT_FLAG_I5TRGE:{
            reg3 = reg3 & ADC_ESTAT_I5TRGE;
            reg1 = reg3;
            reg2 = ADC_IxCTL(adc_periph, 5U) & ADC_ICTL_ITRGEIE;
            break;
        }
        /* ADC inserted sequence5 trigger error interrupt */
        case ADC_INT_FLAG_LTE:{
            reg1 = ADC_DTALTCFG(adc_periph) & ADC_DTALTCFG_LTE;
            reg2 = ADC_DTALTCFG(adc_periph) & ADC_DTALTCFG_LTEIE;
            break;
        }
        default :
            break;
        }

