sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.c
        /*get ADC interrupt flag status */
        if((0U != reg1) && (0U != reg2)) {
            reval = SET;
        } else {
            /* illegal parameters */
        }
    }
    return reval;
}

/*!
    \brief      clear ADC interrupt flag (API_ID(0x0052U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  int_flag: the ADC interrupt flag bits
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_FLAG_EORC:  end of routine sequence conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI0C: end of inserted sequence 0 conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI1C: end of inserted sequence 1 conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI2C: end of inserted sequence 2 conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI3C: end of inserted sequence 3 conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI4C: end of inserted sequence 4 conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI5C: end of inserted sequence 5 conversion interrupt flag
      \arg        ADC_INT_FLAG_EORCHC:  end of routine sequence channel conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI0CHC: end of inserted sequence 0 channel conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI1CHC: end of inserted sequence 0 channel conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI2CHC: end of inserted sequence 2 channel conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI3CHC: end of inserted sequence 3 channel conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI4CHC: end of inserted sequence 4 channel conversion interrupt flag
      \arg        ADC_INT_FLAG_EOI5CHC: end of inserted sequence 5 channel conversion interrupt flag
      \arg        ADC_INT_FLAG_RTRGE: routine sequence trigger error interrupt flag
      \arg        ADC_INT_FLAG_I0TRGE: inserted sequence 0 trigger error interrupt flag
      \arg        ADC_INT_FLAG_I1TRGE: inserted sequence 1 trigger error interrupt flag
      \arg        ADC_INT_FLAG_I2TRGE: inserted sequence 2 trigger error interrupt flag
      \arg        ADC_INT_FLAG_I3TRGE: inserted sequence 3 trigger error interrupt flag
      \arg        ADC_INT_FLAG_I4TRGE: inserted sequence 4 trigger error interrupt flag
      \arg        ADC_INT_FLAG_I5TRGE: inserted sequence 5 trigger error interrupt flag
      \arg        ADC_INT_FLAG_LTE: DAC - ADC loop test error interrupt flag
    \param[out] none
    \retval     none
*/
void adc_interrupt_flag_clear(uint32_t adc_periph, uint32_t int_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0052U), ERR_PERIPH);
    } else if(NOT_ADC_INTERRUPT_FLAG(int_flag)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0052U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(int_flag) {
        /* ADC routine end of sequence conversion interrupt */
        case ADC_INT_FLAG_EORC:
            ADC_STAT(adc_periph) = ~((uint32_t)ADC_STAT_EORC);
            break;
        /* ADC inserted sequence0 end of sequence conversion interrupt */
        case ADC_INT_FLAG_EOI0C:
            ADC_STAT(adc_periph) = ~((uint32_t)ADC_STAT_EOI0C);
            break;
        /* ADC inserted sequence1 end of sequence conversion interrupt */
        case ADC_INT_FLAG_EOI1C:
            ADC_STAT(adc_periph) = ~((uint32_t)ADC_STAT_EOI1C);
            break;
        /* ADC inserted sequence2 end of sequence conversion interrupt */
        case ADC_INT_FLAG_EOI2C:
            ADC_STAT(adc_periph) = ~((uint32_t)ADC_STAT_EOI2C);
            break;
        /* ADC inserted sequence3 end of sequence conversion interrupt */
        case ADC_INT_FLAG_EOI3C:
            ADC_STAT(adc_periph) = ~((uint32_t)ADC_STAT_EOI3C);
            break;
        /* ADC inserted sequence4 end of sequence conversion interrupt */
        case ADC_INT_FLAG_EOI4C:
            ADC_STAT(adc_periph) = ~((uint32_t)ADC_STAT_EOI4C);
            break;
        /* ADC inserted sequence5 end of sequence conversion interrupt */
        case ADC_INT_FLAG_EOI5C:
            ADC_STAT(adc_periph) = ~((uint32_t)ADC_STAT_EOI5C);
            break;
        /* ADC routine sequence end of channel conversion interrupt */
        case ADC_INT_FLAG_EORCHC:
            ADC_STAT(adc_periph) = ~((uint32_t)ADC_STAT_EORCHC);
            break;
        /* ADC inserted sequence0 end of channel conversion interrupt */
        case ADC_INT_FLAG_EOI0CHC:
            ADC_STAT(adc_periph) = ~((uint32_t)ADC_STAT_EOI0CHC);
            break;
        /* ADC inserted sequence1 end of channel conversion interrupt */
        case ADC_INT_FLAG_EOI1CHC:
            ADC_STAT(adc_periph) = ~((uint32_t)ADC_STAT_EOI1CHC);
            break;
        /* ADC inserted sequence2 end of channel conversion interrupt */
        case ADC_INT_FLAG_EOI2CHC:
            ADC_STAT(adc_periph) = ~((uint32_t)ADC_STAT_EOI2CHC);
            break;
        /* ADC inserted sequence3 end of channel conversion interrupt */
        case ADC_INT_FLAG_EOI3CHC:
            ADC_STAT(adc_periph) = ~((uint32_t)ADC_STAT_EOI3CHC);
            break;
        /* ADC inserted sequence4 end of channel conversion interrupt */
        case ADC_INT_FLAG_EOI4CHC:
            ADC_STAT(adc_periph) = ~((uint32_t)ADC_STAT_EOI4CHC);
            break;
        /* ADC inserted sequence0 end of channel conversion interrupt */
        case ADC_INT_FLAG_EOI5CHC:
            ADC_STAT(adc_periph) = ~((uint32_t)ADC_STAT_EOI5CHC);
            break;
        /* ADC routine sequence trigger error interrupt */
        case ADC_INT_FLAG_RTRGE:
            ADC_ESTAT(adc_periph) = ~((uint32_t)ADC_ESTAT_RTRGE);
            break;
        /* ADC inserted sequence0 trigger error interrupt */
        case ADC_INT_FLAG_I0TRGE:
            ADC_ESTAT(adc_periph) = ~((uint32_t)ADC_ESTAT_I0TRGE);
            break;
        /* ADC inserted sequence1 trigger error interrupt */
        case ADC_INT_FLAG_I1TRGE:
            ADC_ESTAT(adc_periph) = ~((uint32_t)ADC_ESTAT_I1TRGE);
            break;
        /* ADC inserted sequence2 trigger error interrupt */
        case ADC_INT_FLAG_I2TRGE:
            ADC_ESTAT(adc_periph) = ~((uint32_t)ADC_ESTAT_I2TRGE);
            break;
        /* ADC inserted sequence3 trigger error interrupt */
        case ADC_INT_FLAG_I3TRGE:
            ADC_ESTAT(adc_periph) = ~((uint32_t)ADC_ESTAT_I3TRGE);
            break;
        /* ADC inserted sequence4 trigger error interrupt */
        case ADC_INT_FLAG_I4TRGE:
            ADC_ESTAT(adc_periph) = ~((uint32_t)ADC_ESTAT_I4TRGE);
            break;
        /* ADC inserted sequence5 trigger error interrupt */
        case ADC_INT_FLAG_I5TRGE:
            ADC_ESTAT(adc_periph) = ~((uint32_t)ADC_ESTAT_I5TRGE);
            break;
        /* DAC - ADC loop test error interrupt flag */
        case ADC_INT_FLAG_LTE:
            ADC_DTALTCFG(adc_periph) &= ~(uint32_t)ADC_DTALTCFG_LTE;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      get ADC sequence channel end of conversion flag (API_ID(0x0053U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  rank: the sequence rank, routine sequence is 0 to 27(ADC2 just supports 0 to 23), and inserted sequence is 0 to 3
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_channel_flag_get(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank)
{
    FlagStatus reval = RESET;

