sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0053U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0053U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_SEQUENCE_RANK(rank)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0053U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            if(0U != (ADC_RCHINF(adc_periph) & ((uint32_t) (0x1U) << rank))) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        } else {
            if(0U != (ADC_IxCHINTF(adc_periph, adc_sequence) & ((uint32_t) (0x1U) << rank))) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        }
    }
    return reval;
}

/*!
    \brief      clear ADC sequence channel end of conversion flag (API_ID(0x0054U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  rank: the sequence rank, routine sequence is 0 to 27(ADC2 just supports 0 to 23), and inserted sequence is 0 to 3
    \param[out] none
    \retval     none
*/
void adc_channel_flag_clear(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0054U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0054U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_SEQUENCE_RANK(rank)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0054U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            ADC_RCHINF(adc_periph) = ~(0x1U << rank);
        } else {
            ADC_IxCHINTF(adc_periph, adc_sequence) = ~(0x1U << rank);
        }
    }
}

/*!
    \brief      enable ADC sequence channel end of conversion interrupt (API_ID(0x0055U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  rank: the sequence rank, routine sequence is 0 to 27(ADC2 just supports 0 to 23), and inserted sequence is 0 to 3
    \param[out] none
    \retval     none
*/
void adc_channel_interrupt_enable(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0055U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0055U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_SEQUENCE_RANK(rank)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0055U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            ADC_RCFGx(adc_periph, rank) |= ((uint32_t)ADC_RCFG_RCHIE);
        } else {
            ADC_IxCFGy(adc_periph, adc_sequence, rank) |= ((uint32_t)ADC_ICFG_ICHIE);
        }
    }
}

/*!
    \brief      disable ADC sequence channel end of conversion interrupt (API_ID(0x0056U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  rank: the sequence rank, routine sequence is 0 to 27(ADC2 just supports 0 to 23), and inserted sequence is 0 to 3
    \param[out] none
    \retval     none
*/
void adc_channel_interrupt_disable(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0056U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0056U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_SEQUENCE_RANK(rank)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0056U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            ADC_RCFGx(adc_periph, rank) &= ~((uint32_t)ADC_RCFG_RCHIE);
        } else {
            ADC_IxCFGy(adc_periph, adc_sequence, rank) &= ~((uint32_t)ADC_ICFG_ICHIE);
        }
    }
}

/*!
    \brief      get ADC sequence channel end of conversion interrupt flag (API_ID(0x0057U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  rank: the sequence rank, routine sequence is 0 to 27(ADC2 just supports 0 to 23), and inserted sequence is 0 to 3
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_channel_interrupt_flag_get(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank)
{
    FlagStatus reval = RESET;
    uint32_t reg1;

