sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x005BU), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x005BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            state = (ADC_RSTREAM(adc_periph) & ADC_RSTREAM_RSTREAMF);
            if((0U != (ADC_RSTREAM(adc_periph) & ADC_RSTREAM_RSTREAMIE))&&(0U != state)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        } else {
            state = (ADC_IxSTREAM(adc_periph, adc_sequence) & ADC_ISTREAM_ISTREAMF);
            if((0U !=(ADC_IxSTREAM(adc_periph, adc_sequence) & ADC_ISTREAM_ISTREAMIE))&&(0U != state)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        }
    }
    return reval;
}

/*!
    \brief      clear the ADC stream conversion complete interrupt flag (API_ID(0x005CU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[out] none
    \retval     none
*/
void adc_stream_interrupt_flag_clear(uint32_t adc_periph, uint32_t adc_sequence)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x005CU), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x005CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            ADC_RSTREAM(adc_periph) &= ~(uint32_t)ADC_RSTREAM_RSTREAMF;
        } else {
            ADC_IxSTREAM(adc_periph, adc_sequence) &= ~(uint32_t)ADC_ISTREAM_ISTREAMF;
        }
    }
}

/*!
    \brief      get ADC self test flag (API_ID(0x005DU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  flag: ADC self test flag bits
                only one parameter can be selected which is shown as below:
      \arg        ADC_SELFTEST_FLAG_STODE: selftest step order error flag
      \arg        ADC_SELFTEST_FLAG_WDTE: selftest watchdog timer error flag
      \arg        ADC_SELFTEST_FLAG_CSTE: selftest capacitive error flag
      \arg        ADC_SELFTEST_FLAG_SSTE0: selftest supply step0 error flag
      \arg        ADC_SELFTEST_FLAG_SSTE1: selftest supply step1 error flag
      \arg        ADC_SELFTEST_FLAG_SSTE2: selftest supply step2 error flag
      \arg        ADC_SELFTEST_FLAG_STEOVW: selftest error status overwrtie flag
      \arg        ADC_SELFTEST_FLAG_EOSSTC: all supply selftest steps end flag
      \arg        ADC_SELFTEST_FLAG_EOCSTC: all capacitive selftest steps end flag
      \arg        ADC_SELFTEST_FLAG_EOSTC: selftest end of conversion flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_selftest_flag_get(uint32_t adc_periph, uint32_t flag)
{
    FlagStatus reval = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x005DU), ERR_PERIPH);
    } else if(NOT_ADC_SELFTEST_FLAG(flag)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x005DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != (ADC_STSTAT(adc_periph) & flag)) {
            reval = SET;
        } else {
            /* illegal parameters */
        }
    }
    return reval;
}

/*!
    \brief      clear ADC selftest flag (API_ID(0x005EU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  flag: the ADC self test flag bits
                only one parameter can be selected which is shown as below:
      \arg        ADC_SELFTEST_FLAG_STODE: selftest step order error flag
      \arg        ADC_SELFTEST_FLAG_WDTE: selftest watchdog timer error flag
      \arg        ADC_SELFTEST_FLAG_CSTE: selftest capacitive error flag
      \arg        ADC_SELFTEST_FLAG_SSTE0: selftest supply step0 error flag
      \arg        ADC_SELFTEST_FLAG_SSTE1: selftest supply step1 error flag
      \arg        ADC_SELFTEST_FLAG_SSTE2: selftest supply step2 error flag
      \arg        ADC_SELFTEST_FLAG_STEOVW: selftest error status overwrtie flag
      \arg        ADC_SELFTEST_FLAG_EOSSTC: all supply selftest steps end flag
      \arg        ADC_SELFTEST_FLAG_EOCSTC: all capacitive selftest steps end flag
      \arg        ADC_SELFTEST_FLAG_EOSTC: selftest end of conversion flag
    \param[out] none
    \retval     none
*/
void adc_selftest_flag_clear(uint32_t adc_periph, uint32_t flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x005EU), ERR_PERIPH);
    } else if(NOT_ADC_SELFTEST_FLAG(flag)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x005EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_STSTAT(adc_periph) = ~(uint32_t)flag;
    }
}

/*!
    \brief      enable ADC selftest interrupt (API_ID(0x005FU))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  interrupt: the ADC selftest interrupt
                only one parameter can be selected which is shown as below:
      \arg        ADC_SELFTEST_INT_FMUSSTEIE: interrupt for supply selftest error to FMU
      \arg        ADC_SELFTEST_INT_FMUCSTEIE: interrupt for capacitive selftest error to FMU
      \arg        ADC_SELFTEST_INT_FMUWDTEIE: interrupt for watchdog timer error to FMU
      \arg        ADC_SELFTEST_INT_FMUSTODEIE: interrup for selftest sequence error to FMU
      \arg        ADC_SELFTEST_INT_STODEIE: interrupt for step order error
      \arg        ADC_SELFTEST_INT_WDTEIE: interrupt for watchdog timer error
      \arg        ADC_SELFTEST_INT_CSTEIE: interrupt for capacitive selftest error
      \arg        ADC_SELFTEST_INT_SSTEIE0: interrupt for supply selftest step0 error
      \arg        ADC_SELFTEST_INT_SSTEIE1: interrupt for supply selftest step1 error
      \arg        ADC_SELFTEST_INT_SSTEIE2: interrupt for supply selftest step2 error
      \arg        ADC_SELFTEST_INT_STEOVWIE: interrupt for selftest error(SERR2,SERR1,SERR0,CERR) be overwrite
      \arg        ADC_SELFTEST_INT_EOSSTCIE: interrupt for all supply selftest end
      \arg        ADC_SELFTEST_INT_EOCSTCIE: interrupt for all capacitive selftest end
      \arg        ADC_SELFTEST_INT_EOSTCIE: interrupt for all selftest end
    \param[out] none
    \retval     none
*/
void adc_selftest_interrupt_enable(uint32_t adc_periph, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x005FU), ERR_PERIPH);
    } else if(NOT_ADC_SELFTEST_INTERRUPT(interrupt)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x005FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(interrupt) {
        /* enable the interrupt of supply selftest error to FMU enable */
        case ADC_SELFTEST_INT_FMUSSTEIE:
            ADC_STINTEN(adc_periph) |= (uint32_t)ADC_STINTEN_FMUSSTEIE;
            break;
        /* enable the interrupt of capacitive selftest error to FMU enable */
        case ADC_SELFTEST_INT_FMUCSTEIE:
            ADC_STINTEN(adc_periph) |= (uint32_t)ADC_STINTEN_FMUCSTEIE;
            break;
        /* enable the interrupt of watchdog timer error to FMU enable */
        case ADC_SELFTEST_INT_FMUWDTEIE:
            ADC_STINTEN(adc_periph) |= (uint32_t)ADC_STINTEN_FMUWDTEIE;
            break;
        /* enable the interrupt of selftest sequence error to FMU enable */
        case ADC_SELFTEST_INT_FMUSTODEIE:
            ADC_STINTEN(adc_periph) |= (uint32_t)ADC_STINTEN_FMUSTODEIE;
            break;
        /* enable the interrupt of selftest step order error enable */
        case ADC_SELFTEST_INT_STODEIE:
            ADC_STINTEN(adc_periph) |= (uint32_t)ADC_STINTEN_STODEIE;
            break;
        /* enable the interrupt of watchdog timer error enable */
        case ADC_SELFTEST_INT_WDTEIE:
            ADC_STINTEN(adc_periph) |= (uint32_t)ADC_STINTEN_WDTEIE;
            break;
        /* enable the interrupt of capacitive selftest error enable */
        case ADC_SELFTEST_INT_CSTEIE:
            ADC_STINTEN(adc_periph) |= (uint32_t)ADC_STINTEN_CSTEIE;
            break;
        /* enable the interrupt of supply selftest step0 error enable */
        case ADC_STINTEN_SST0EIE:
            ADC_STINTEN(adc_periph) |= (uint32_t)ADC_STINTEN_SST0EIE;
            break;
        /* enable the interrupt of supply selftest step1 error enable */
        case ADC_STINTEN_SST1EIE:
            ADC_STINTEN(adc_periph) |= (uint32_t)ADC_STINTEN_SST1EIE;
            break;
        /* enable the interrupt of supply selftest step2 error enable */
        case ADC_STINTEN_SST2EIE:
            ADC_STINTEN(adc_periph) |= (uint32_t)ADC_STINTEN_SST2EIE;
            break;
        /* enable the interrupt of selftest error(SERR2,SERR1,SERR0,CERR) be overwrite */
        case ADC_SELFTEST_INT_STEOVWIE:
            ADC_STINTEN(adc_periph) |= (uint32_t)ADC_STINTEN_STEOVWIE;
            break;
        /* enable the interrupt of all supply selftest end enable */
        case ADC_SELFTEST_INT_EOSSTCIE:
            ADC_STINTEN(adc_periph) |= (uint32_t)ADC_STINTEN_EOSSTCIE;
            break;
        /* enable the interrupt of all capacitive selftest end enable */
        case ADC_SELFTEST_INT_EOCSTCIE:
            ADC_STINTEN(adc_periph) |= (uint32_t)ADC_STINTEN_EOCSTCIE;
            break;
        /* enable the interrupt of all selftest end enable */
        case ADC_SELFTEST_INT_EOSTCIE:
            ADC_STINTEN(adc_periph) |= (uint32_t)ADC_STINTEN_EOSTCIE;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      disable ADC selftest interrupt (API_ID(0x0060U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  interrupt: the ADC selftest interrupt
                only one parameter can be selected which is shown as below:
      \arg        ADC_SELFTEST_INT_FMUSSTEIE: interrupt for supply selftest error to FMU
      \arg        ADC_SELFTEST_INT_FMUCSTEIE: interrupt for capacitive selftest error to FMU
      \arg        ADC_SELFTEST_INT_FMUWDTEIE: interrupt for watchdog timer error to FMU
      \arg        ADC_SELFTEST_INT_FMUSTODEIE: interrup for selftest sequence error to FMU
      \arg        ADC_SELFTEST_INT_STODEIE: interrupt for step order error error
      \arg        ADC_SELFTEST_INT_WDTEIE: interrupt for watchdog timer error
      \arg        ADC_SELFTEST_INT_CSTEIE: interrupt for capacitive selftest error
      \arg        ADC_SELFTEST_INT_SSTEIE0: interrupt for supply selftest step0 error
      \arg        ADC_SELFTEST_INT_SSTEIE1: interrupt for supply selftest step1 error
      \arg        ADC_SELFTEST_INT_SSTEIE2: interrupt for supply selftest step2 error
      \arg        ADC_SELFTEST_INT_STEOVWIE: interrupt for selftest error(SERR2,SERR1,SERR0,CERR) be overwrite
      \arg        ADC_SELFTEST_INT_EOSSTCIE: interrupt for all supply selftest end
      \arg        ADC_SELFTEST_INT_EOCSTCIE: interrupt for all capacitive selftest end
      \arg        ADC_SELFTEST_INT_EOSTCIE: interrupt for all selftest end
    \param[out] none
    \retval     none
*/
void adc_selftest_interrupt_disable(uint32_t adc_periph, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0060U), ERR_PERIPH);
    } else if(NOT_ADC_SELFTEST_INTERRUPT(interrupt)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0060U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(interrupt) {
        /* enable the interrupt of supply selftest error to FMU enable */
        case ADC_SELFTEST_INT_FMUSSTEIE:
            ADC_STINTEN(adc_periph) &= ~(uint32_t)ADC_STINTEN_FMUSSTEIE;
            break;
        /* enable the interrupt of capacitive selftest error to FMU enable */
        case ADC_SELFTEST_INT_FMUCSTEIE:
            ADC_STINTEN(adc_periph) &= ~(uint32_t)ADC_STINTEN_FMUCSTEIE;
            break;
        /* enable the interrupt of watchdog timer error to FMU enable */
        case ADC_SELFTEST_INT_FMUWDTEIE:
            ADC_STINTEN(adc_periph) &= ~(uint32_t)ADC_STINTEN_FMUWDTEIE;
            break;
        /* enable the interrupt of selftest sequence error to FMU enable */
        case ADC_SELFTEST_INT_FMUSTODEIE:
            ADC_STINTEN(adc_periph) &= ~(uint32_t)ADC_STINTEN_FMUSTODEIE;
            break;
        /* enable the interrupt of selftest step order error enable */
        case ADC_SELFTEST_INT_STODEIE:
            ADC_STINTEN(adc_periph) &= ~(uint32_t)ADC_STINTEN_STODEIE;
            break;
        /* enable the interrupt of watchdog timer error enable */
        case ADC_SELFTEST_INT_WDTEIE:
            ADC_STINTEN(adc_periph) &= ~(uint32_t)ADC_STINTEN_WDTEIE;
            break;
        /* enable the interrupt of capacitive selftest error enable */
        case ADC_SELFTEST_INT_CSTEIE:
            ADC_STINTEN(adc_periph) &= ~(uint32_t)ADC_STINTEN_CSTEIE;
            break;
        /* enable the interrupt of supply selftest step0 error enable */
        case ADC_SELFTEST_INT_SSTEIE0:
            ADC_STINTEN(adc_periph) &= ~(uint32_t)ADC_STINTEN_SST0EIE;
            break;
        /* enable the interrupt of supply selftest step1 error enable */
        case ADC_SELFTEST_INT_SSTEIE1:
            ADC_STINTEN(adc_periph) &= ~(uint32_t)ADC_STINTEN_SST1EIE;
            break;
        /* enable the interrupt of supply selftest step2 error enable */
        case ADC_SELFTEST_INT_SSTEIE2:
            ADC_STINTEN(adc_periph) &= ~(uint32_t)ADC_STINTEN_SST2EIE;
            break;
        /* enable the interrupt of selftest error(SERR2,SERR1,SERR0,CERR) be overwrite */
        case ADC_SELFTEST_INT_STEOVWIE:
            ADC_STINTEN(adc_periph) &= ~(uint32_t)ADC_STINTEN_STEOVWIE;
            break;
        /* enable the interrupt of all supply selftest end enable */
        case ADC_SELFTEST_INT_EOSSTCIE:
            ADC_STINTEN(adc_periph) &= ~(uint32_t)ADC_STINTEN_EOSSTCIE;
            break;
        /* enable the interrupt of all capacitive selftest end enable */
        case ADC_SELFTEST_INT_EOCSTCIE:
            ADC_STINTEN(adc_periph) &= ~(uint32_t)ADC_STINTEN_EOCSTCIE;
            break;
        /* enable the interrupt of all selftest end enable */
        case ADC_SELFTEST_INT_EOSTCIE:
            ADC_STINTEN(adc_periph) &= ~(uint32_t)ADC_STINTEN_EOSTCIE;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      get ADC self test interrupt flag (API_ID(0x0061U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  int_flag: ADC self test flag bits
                only one parameter can be selected which is shown as below:
      \arg        ADC_SELFTEST_INT_FLAG_STODE: selftest step order error interrupt flag
      \arg        ADC_SELFTEST_INT_FLAG_WDTE: selftest watchdog timer error interrupt flag
      \arg        ADC_SELFTEST_INT_FLAG_CSTE: selftest capacitive error interrupt flag
      \arg        ADC_SELFTEST_INT_FLAG_SSTE0: selftest supply step0 error interrupt flag
      \arg        ADC_SELFTEST_INT_FLAG_SSTE1: selftest supply step1 error interrupt flag
      \arg        ADC_SELFTEST_INT_FLAG_SSTE2: selftest supply step2 error interrupt flag
      \arg        ADC_SELFTEST_INT_FLAG_STEOVW: selftest error status overwrtie interrupt flag
      \arg        ADC_SELFTEST_INT_FLAG_EOSSTC: all supply selftest steps end interrupt flag
      \arg        ADC_SELFTEST_INT_FLAG_EOCSTC: all capacitive selftest steps end interrupt flag
      \arg        ADC_SELFTEST_INT_FLAG_EOSTC: selftest end of conversion interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_selftest_interrupt_flag_get(uint32_t adc_periph, uint32_t int_flag)
{
    FlagStatus reval = RESET;
    uint32_t state;

