sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0061U), ERR_PERIPH);
    } else if(NOT_ADC_SELFTEST_INTERRUPT_FLAG(int_flag)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0061U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* check the interrupt bits */
        switch(int_flag) {
        case ADC_SELFTEST_INT_FLAG_STODE:
            /* get the selftest step order error interrupt flag */
            state = ADC_STSTAT(adc_periph) & ADC_STSTAT_STODE;
            if((0U != (ADC_STINTEN(adc_periph) & ADC_STINTEN_STODEIE)) && (0U != state)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
            break;
        case ADC_SELFTEST_INT_FLAG_WDTE:
            /* get the selftest watchdog timer error interrupt flag */
            state = ADC_STSTAT(adc_periph) & ADC_STSTAT_WDTE;
            if((0U != (ADC_STINTEN(adc_periph) & ADC_STINTEN_WDTEIE)) && (0U != state)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
            break;
        case ADC_SELFTEST_INT_FLAG_CSTE:
            /* get the selftest capacitive error interrupt flag */
            state = ADC_STSTAT(adc_periph) & ADC_STSTAT_CSTE;
            if((0U != (ADC_STINTEN(adc_periph) & ADC_STINTEN_CSTEIE)) && (0U != state)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
            break;
        case ADC_SELFTEST_INT_FLAG_SSTE0:
            /* get the selftest supply step0 error interrupt flag */
            state = ADC_STSTAT(adc_periph) & ADC_STSTAT_SST0E;
            if((0U != (ADC_STINTEN(adc_periph) & ADC_STINTEN_SST0EIE)) && (0U != state)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
            break;
        case ADC_SELFTEST_INT_FLAG_SSTE1:
            /* get the selftest supply step1 error interrupt flag */
            state = ADC_STSTAT(adc_periph) & ADC_STSTAT_SST1E;
            if((0U != (ADC_STINTEN(adc_periph) & ADC_STINTEN_SST1EIE)) && (0U != state)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
            break;
        case ADC_SELFTEST_INT_FLAG_SSTE2:
            /* get the selftest supply step2 error interrupt flag */
            state = ADC_STSTAT(adc_periph) & ADC_STSTAT_SST2E;
            if((0U != (ADC_STINTEN(adc_periph) & ADC_STINTEN_SST2EIE)) && (0U != state)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
            break;
        case ADC_SELFTEST_INT_FLAG_STEOVW:
            /* get the selftest error status overwrtie interrupt flag */
            state = ADC_STSTAT(adc_periph) & ADC_STSTAT_STEOVW;
            if((0U != (ADC_STINTEN(adc_periph) & ADC_STINTEN_STEOVWIE)) && (0U != state)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
            break;
        case ADC_SELFTEST_INT_FLAG_EOSSTC:
            /* get all supply selftest steps end interrupt flag */
            state = ADC_STSTAT(adc_periph) & ADC_STSTAT_EOSSTC;
            if((0U != (ADC_STINTEN(adc_periph) & ADC_STINTEN_EOSSTCIE)) && (0U != state)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
            break;
        case ADC_SELFTEST_INT_FLAG_EOCSTC:
            /* get all capacitive selftest steps end interrupt flag */
            state = ADC_STSTAT(adc_periph) & ADC_STSTAT_EOCSTC;
            if((0U != (ADC_STINTEN(adc_periph) & ADC_STINTEN_EOCSTCIE)) && (0U != state)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
            break;
        case ADC_SELFTEST_INT_FLAG_EOSTC:
            /* get the selftest end of conversion interrupt flag */
            state = ADC_STSTAT(adc_periph) & ADC_STSTAT_EOSTC;
            if((0U != (ADC_STINTEN(adc_periph) & ADC_STINTEN_EOSTCIE)) && (0U != state)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
            break;
        default:
            break;
        }
    }
    return reval;
}

/*!
    \brief      clear ADC selftest flag (API_ID(0x0062U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  int_flag: the ADC self test flag bits
                only one parameter can be selected which is shown as below:
      \arg        ADC_SELFTEST_INT_FLAG_STODE: selftest step order error interrupt flag
      \arg        ADC_SELFTEST_INT_FLAG_WDTE: selftest watchdog timer error interrupt flag
      \arg        ADC_SELFTEST_INT_FLAG_CSTE: selftest capacitive error interrupt flag
      \arg        ADC_SELFTEST_INT_FLAG_SSTE0: selftest supply step0 error interrupt flag
      \arg        ADC_SELFTEST_INT_FLAG_SSTE1: selftest supply step1 error interrupt flag
      \arg        ADC_SELFTEST_INT_FLAG_SSTE2: selftest supply step2 error interrupt flag
      \arg        ADC_SELFTEST_INT_FLAG_STEOVW: selftest error status overwrtie interrupt flag
      \arg        ADC_SELFTEST_INT_FLAG_EOSSTC: all supply selftest steps end interrupt flag
      \arg        ADC_SELFTEST_INT_FLAG_EOCSTC: all capacitive selftest steps end interrupt flag
      \arg        ADC_SELFTEST_INT_FLAG_EOSTC: selftest end of conversion interrupt flag
    \param[out] none
    \retval     none
*/
void adc_selftest_interrupt_flag_clear(uint32_t adc_periph, uint32_t int_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0062U), ERR_PERIPH);
    } else if(NOT_ADC_SELFTEST_INTERRUPT_FLAG(int_flag)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0062U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_STSTAT(adc_periph) = ~(uint32_t)int_flag;
    }
}

/*!
    \brief      get ADC channel analog watchdog flag (API_ID(0x0063U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_channel: it can be 0~61
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_channel_analog_watchdog_flag_get(uint32_t adc_periph, uint32_t adc_channel)
{
    FlagStatus reval = RESET;

