sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0063U), ERR_PERIPH);
    } else if(NOT_ADC_CHANNEL(adc_channel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0063U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if((31U < adc_channel) && (61U >= adc_channel)) {
            /* get channel 32~61 analog watchdog flag */
            if(0U != (ADC_WDINTF1(adc_periph) & ((uint32_t) (0x1U) << (adc_channel-32U)))) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        } else {
            /* get channel 0~31 analog watchdog flag */
            if(0U != (ADC_WDINTF0(adc_periph) & ((uint32_t) (0x1U) << adc_channel))) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        }
    }
    return reval;
}

/*!
    \brief      clear ADC channel analog watchdog flag (API_ID(0x0064U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_channel: it can be 0~61 or 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void adc_channel_analog_watchdog_flag_clear(uint32_t adc_periph, uint32_t adc_channel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0064U), ERR_PERIPH);
    } else if(NOT_ADC_WATCHDOG_CHANNEL(adc_channel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0064U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if((adc_channel > 31U) && (adc_channel <= 61U)) {
            /* clear channel 32~61 analog watchdog flag */
            ADC_WDINTF1(adc_periph) = ~(0x1U << (adc_channel-32U));
        } else if(adc_channel <= 31U) {
            /* clear channel 0~31 analog watchdog flag */
            ADC_WDINTF0(adc_periph) = ~(0x1U << adc_channel);
        } else if(0xFFFFFFFFU == adc_channel) {
            /* clear all channel flags */
            ADC_ESTAT(adc_periph) = ~(uint32_t)ADC_FLAG_WDE;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      get ADC channel analog watchdog interrupt flag (API_ID(0x0065U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_channel: it can be 0~61
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_channel_analog_watchdog_interrupt_flag_get(uint32_t adc_periph, uint32_t adc_channel)
{
    FlagStatus reval = RESET;
    uint32_t index;
    uint32_t status;

    index = (ADC_CHCFGx(adc_periph, adc_channel) & ADC_CHCFG_WDSEL) >> 3U;
    status = ADC_WDTx(adc_periph, index) & ADC_WDT_WDEIE;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0065U), ERR_PERIPH);
    } else if(NOT_ADC_CHANNEL(adc_channel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0065U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if((31U < adc_channel) && (61U >= adc_channel)) {
            /* get channel 32~61 analog watchdog flag */
            if((0U != (ADC_WDINTF1(adc_periph) & ((uint32_t) (0x1U) << (adc_channel-32U)))) && (0U != status)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        } else {
            /* get channel 0~31 analog watchdog flag */
            if((0U != (ADC_WDINTF0(adc_periph) & ((uint32_t) (0x1U) << adc_channel))) && (0U != status)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        }
    }
    return reval;
}

/*!
    \brief      clear ADC channel analog watchdog interrupt flag (API_ID(0x0066U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_channel: it can be 0~61 or 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void adc_channel_analog_watchdog_interrupt_flag_clear(uint32_t adc_periph, uint32_t adc_channel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0066U), ERR_PERIPH);
    } else if(NOT_ADC_WATCHDOG_CHANNEL(adc_channel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0066U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if((adc_channel > 31U) && (adc_channel <= 61U)) {
            /* clear channel 32~61 analog watchdog interrupt flag */
            ADC_WDINTF1(adc_periph) = ~(0x1U << (adc_channel-32U));
        } else if(adc_channel <= 31U) {
            /* clear channel 0~31 analog watchdog interrupt flag */
            ADC_WDINTF0(adc_periph) = ~(0x1U << adc_channel);
        } else if(0xFFFFFFFFU == adc_channel) {
            /* clear all channel interrupt flags */
            ADC_ESTAT(adc_periph) = ~(uint32_t)ADC_FLAG_WDE;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      get ADC sequence channel overwrite interrupt flag (API_ID(0x0067U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[in]  rank: the sequence rank, routine sequence is 0 to 27(ADC2 just supports 0 to 23), and inserted sequence is 0 to 3
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_channel_overwrite_interrupt_flag_get(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank)
{
    FlagStatus reval = RESET;
    uint32_t reg1;

