sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0067U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0067U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_SEQUENCE_RANK(rank)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0067U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg1 = ADC_CTL(adc_periph) & ADC_CTL_CHOVWIE;
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            /*get routine sequence channel interrupt flag status */
            if((0U != (ADC_RCHDATAx(adc_periph,rank) & ADC_RCHDATA_RCHOVWF)) && (0U != reg1)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        } else {
            /*get inserted sequence channel interrupt flag status */
            if((0U != (ADC_IxCHDATAy(adc_periph, adc_sequence, rank) & ADC_ICHDATA_ICHOVWF)) && (0U != reg1)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        }
    }
    return reval;
}

/*!
    \brief      get the ADC sequence interrupt overwrite flag (API_ID(0x0068U))
    \param[in]  adc_periph: ADCx, x=0,1,2 (x=2 only available in GD32A714X, GD32A72XX and GD32A74XX)
    \param[in]  int_flag: the ADC interrupt flag bits
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_SEQUENCE: routine sequence
      \arg        ADC_INSERTED_SEQUENCE0: inserted sequence 0
      \arg        ADC_INSERTED_SEQUENCE1: inserted sequence 1
      \arg        ADC_INSERTED_SEQUENCE2: inserted sequence 2
      \arg        ADC_INSERTED_SEQUENCE3: inserted sequence 3
      \arg        ADC_INSERTED_SEQUENCE4: inserted sequence 4
      \arg        ADC_INSERTED_SEQUENCE5: inserted sequence 5
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_overwrite_interrupt_flag_get(uint32_t adc_periph, uint32_t adc_sequence)
{
    uint32_t reg1;
    FlagStatus reval = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_periph(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0069U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0069U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg1 = ADC_CTL(adc_periph) & ADC_CTL_OVWIE;
        if(ADC_ROUTINE_SEQUENCE == adc_sequence) {
            /*get routine sequence channel interrupt flag status */
            if((0U != (ADC_RDATA(adc_periph) & ADC_RDATA_ROVWF)) && (0U != reg1)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        } else {
            /*get inserted sequence channel interrupt flag status */
            if((0U != (ADC_IxDATA(adc_periph, adc_sequence) & ADC_IDATA_IOVWF)) && (0U != reg1)) {
                reval = SET;
            } else {
                /* illegal parameters */
            }
        }
    }
    return reval;
}

